{
    "https://www.bbc.co.uk/sounds/play/p0mp0dgl": {
        "source": "BBC News",
        "topic": "politics",
        "title": "Are Foreign Countries Interfering in UK Politics?",
        "content": "Available for over a year\n\nToday, the government has ordered an independent review into foreign financial interference in UK politics. The government say this is in response to what it called the “shocking” case of Nathan Gill, the former leader of Reform UK in Wales. Gill was jailed in November, after admitting to taking bribes for pro-Russian interviews and speeches when he was a Member of the European Parliament (MEP). Announcing the review, Communities Secretary Steve Reed said the government must \"learn the lessons\" from the case so \"this can never happen again\". Responding to Reed's statement in the Commons, Reform UK's deputy leader Richard Tice said his party welcomed the review but called on the government to also make sure it looked into the influence of China on the Labour Party. Victoria and Chris discuss what the review could mean Plus, President Trump has filed, what is being reported as, a $5 billion dollar lawsuit against the BBC. Caitríona Perry and the FT’s global media editor Daniel Thomas explain what’s in the lawsuit and why the BBC has said it plans to fight it. You can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. You can join our Newscast online community here: https://bbc.in/newscastdiscord Get in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480. New episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd Newscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Victoria Derbyshire. It was made by Jack Maclaren with Anna Harris and Jem Westgate. The social producer was Sophie Millward. The technical producer was Jonny Hall. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.\n\nProgramme Website"
    },
    "https://www.bbc.com/news/articles/cj38m11218xo": {
        "source": "BBC News",
        "topic": "politics",
        "title": "How X's new location feature exposed big US politics accounts",
        "content": "How X's new location feature exposed big US politics accounts\n\n24 November 2025 Share Save Shayan Sardarizadeh, Thomas Copeland and Tom Edgington BBC Verify, Washington DC and London Share Save\n\nBBC\n\nDozens of high-engagement accounts on X have been accused of misleading users following the roll-out of a new transparency feature that shows user locations. Users on the social network seized on examples of pro-Trump accounts that posted about US politics, but which turned out to be based outside the US. There were also anti-Trump accounts with misleading locations too. Posts from some of the accounts have attracted millions of impressions - views, likes, reposts and replies - which can result in payment from X. BBC Verify is not able to independently confirm the information X provides about each account.\n\nX says data is '99% accurate'\n\nThe location data is visible in a new \"about this account\" tab which appears on every profile. It also contains a warning that the location data may be affected by recent travel, temporary relocation and the use of virtual private networks (VPNs). However, according to X's head of product, Nikita Bier, the information is 99% accurate. On Saturday, Trump shared on Truth Social a screenshot of a post from an X account called \"TRUMP_ARMY_\" celebrating a Supreme Court ruling it says will allow the president to deport criminals to El Salvador. This account has gathered more than half a million followers, including a senior Republican senator. But X's data has revealed the account is based in India and the username changed four times since March 2022, the last of which was in July 2022.\n\nThe account profile has now been changed to \"an Indian who loves America, President Trump, Musk!\" Another, account called \"IvankaNews_\", which describes itself as a fan account for Trump's daughter, has gathered more than one million followers and has previously posted about voting for the president last year. However, the account is based in Nigeria and its username has changed 11 times since 2010, according to X.\n\nAfter its location was revealed, the account posted that \"some of us living outside the USA genuinely support President Trump's movement\". X now appears to have suspended \"IvankaNews_\", but the reason is unclear.\n\nA 'proud Democrat' in Kenya\n\nBBC Verify has also found examples of accounts sharing anti-Trump posts, which are actually based outside the US according to X's new feature. One account, with 52,000 followers, claimed to be a \"proud Democrat\" and \"professional Maga hunter\". The user appears to have deleted their profile after it was revealed that they were based in Kenya.\n\nScottish politics affected too\n\nBBC Verify has also seen a number of accounts claiming to be from Scotland and almost exclusively posting in favour of Scottish independence. However according to X's location data, these accounts appear to be accessing X from the Android app in Iran. The location tab says they are based in the Netherlands, but X has added a warning sign to indicate that the accounts may be using a VPN.\n\nBBC Verify has attempted to contact these accounts but has not received any response.\n\n'Make a buck by pretending'\n\nMost of these accounts have held blue ticks. This means they subscribe to X's Premium feature and could potentially earn money from their posts depending on their engagement rates. X users need to satisfy several criteria to gain access to its monetisation programme, including passing identity checks and having more than 5 million impressions within three months. Alexios Mantzarlis from Cornell Tech says blue tick accounts are exacerbating problems on the platform. \"The blue ticks on these accounts tell us one thing we already knew: X's pay-for-play badging is just a revenue generator and not a serious verification effort.\" However, he adds that other features, like \"community notes\" that allow contributors to append context to a viral post, shows the platform is taking transparency seriously."
    },
    "https://www.theverge.com/news/846903/billionaire-jared-isaacman-confirmed-as-new-head-of-nasa": {
        "source": "The Verge",
        "topic": "politics",
        "title": "Billionaire Jared Isaacman confirmed as new head of NASA",
        "content": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nThe Senate confirmed Jared Isaacman’s appointment as the head of NASA on Wednesday, a decision that comes just months after President Donald Trump pulled his nomination before picking him yet again in November, as reported earlier by CNBC.\n\nIsaacman, the founder and CEO of a payments platform called Shift4, has flown to space twice through private missions with Elon Musk’s SpaceX. After choosing Isaacman as head of NASA in December 2024, Trump pulled his nomination in May, later saying in a Truth Social post that he thought it would be “inappropriate that a very close friend of Elon, who was in the Space Business, run NASA.”\n\nIsaacman attempted to dispel concerns about his ties to Musk during a hearing earlier this month, saying that he “led two missions to space with SpaceX because it’s the only organization that can send astronauts to and from space since the shuttle was retired,” as reported by RollCall.\n\nWhen nominating Isaacman for a second time, Trump said the billionaire is “ideally suited to lead NASA into a bold new Era.”"
    },
    "https://www.theverge.com/entertainment/842852/https-www-theverge-com-tech-841025-2025-review-games-streaming-politics": {
        "source": "The Verge",
        "topic": "politics",
        "title": "The Verge’s 2025 in review",
        "content": "The year 2025 has been, to put it mildly, eventful. If you’re like me, you’ve felt as if it’s pretty much impossible to keep up with things; every day brings something new, much of it baffling or enraging.\n\nBut that’s not the case for everything — and so, as with past years, we’re using this as a chance to reminisce. Over the next two weeks, we’ll be publishing stories from our reporters who cover the most important or weird trends in politics, tech, and culture. We’ll also have roundups to help you navigate 2025’s many, many releases across gaming platforms and streaming services. Perfect for those in-between-holidays days."
    },
    "https://www.bbc.com/news/articles/c773vm4n3n0o": {
        "source": "BBC News",
        "topic": "gender equality",
        "title": "Trans women will not be allowed to attend main Labour Women's Conference events",
        "content": "Trans women will not be allowed to attend main Labour Women's Conference events\n\nMinister for women and equalities Bridget Phillipson speaks at the 2025 Labour Party Conference\n\nIt is understood the party considers the format to be the least restrictive way of balancing accessibility and compliance with the law.\n\nTrans women will not be able to take part in formal proceedings, including speeches in the main hall and policy debates, but will be able to attend fringe events, which will be open to everyone regardless of their sex.\n\nIt follows a legal review into how the event should operate after the Supreme Court ruled in April that a woman is defined by biological sex under equalities legislation.\n\nTrans women will not be able to take part in the main session at the Labour Women's Conference next year.\n\nThe Women's Conference, which is usually held the day before the party's annual conference in the same venue, was cancelled in 2025 after the party received legal advice in the wake of the Supreme Court ruling.\n\nPrior to that ruling, Labour had allowed people to self-identify as a woman, so trans women could attend the event and also take part in \"positive action\" measures such as all-women shortlists.\n\nLabour launched a \"comprehensive legal review\" of the rules around its women's conference following the Supreme Court decision, a spokesperson said, before confirming the 2026 event would go ahead with new attendance rules in a place.\n\nThe spokesperson continued: \"This reflects our commitment to addressing the under-representation of women in the Party and compliance with the law.\"\n\nIt comes as the government continues to weigh a new code of practice in light of the ruling, guidance which issued to public bodies and businesses on how to apply the Equality Act.\n\nThe code has been redrafted by the equality watchdog, the Equality and Human Rights Commission, and submitted to the government for ministerial sign off before coming into force.\n\nEqualities minister Bridget Phillipson received the draft three months ago but said she would take the time needed to \"get this right\" before publishing.\n\nThe EHRC under its current leadership has previously called on the government to sign off on the guidance quickly.\n\nOutgoing EHRC head Baroness Falkner of Margravine told the Times she was \"so certain\" of the lawfulness of the guidance and suggested one explanation for the delay could be that the government was \"terrified of their MPs who would wish for trans self-identification or trans inclusion to prevail across all areas of society\".\n\nShe said the delay had led to a \"grey zone\" being created around single-sex spaces.\n\n\"Some organisations are implementing [the ruling] in one way, others are not,\" Baroness Falkner said.\n\nIn response, a government spokesperson said it was \"unapologetic about taking the time to produce legally sound guidance\".\n\nThey added \"rushed and flawed guidance\" would be \"utterly catastrophic and fail women across our country\"."
    },
    "https://www.bbc.com/news/articles/cpq4ydrprpgo": {
        "source": "BBC News",
        "topic": "gender equality",
        "title": "Equality boss expects people to 'follow rules' over single-sex spaces",
        "content": "'Toilet police' not expected over single-sex space guidance, equality boss says\n\nWatch: Nobody expecting \"toilet police\", says UK equality chief\n\nThe BBC interview, broadcast on Sunday with Laura Kuenssberg, is Dr Stephenson's first in her new role.\n\nThe guidance, for businesses and services, was drawn up after a unanimous Supreme Court ruling in April that legally a woman should be defined by biological sex for the purposes of the Equality Act 2010.\n\nDr Mary-Ann Stephenson, chair of the Equality and Human Rights Commission (EHRC), said \"things could be sorted out if there is goodwill and recognition that everybody has rights\".\n\nNobody is expecting there to be a \"toilet police\" but everyone should \"follow the rules\" when guidance on single-sex spaces is released, the new head of the equality watchdog has told the BBC.\n\nThe EHRC's guidance was passed to the government three months ago, but it has yet to publish it formally, which would give the code of practice legal force.\n\nIt aims to provide advice to businesses and services - such as women's refuges, gyms, hospitals or shopping centres - about how the Supreme Court ruling should work.\n\nSeen by the BBC after it was leaked, the 300-page document says single-sex spaces should only be open to people of the same biological sex, otherwise they cease to be single-sex areas.\n\nThat would mean, for instance, that a trans woman – a biological male who identifies as a woman - would not be able to use women's toilets and changing rooms.\n\nThe guidance says it may be legitimate for businesses or services to ask people to provide confirmation they are of the eligible sex \"by proportionate means\".\n\nThis has all caused controversy and anger among some transgender campaigners.\n\nDr Stephenson told the BBC: \"Nobody is expecting there to be a toilet police.\n\n\"But equally if there are situations where there are complaints about regular problems, then people might need to... improve signage, improve explanations, or make sure they have got alternative provision.\"\n\nShe said she expected both service providers and people using these services to \"follow the rules\".\n\nDr Stephenson was challenged on what facilities trans people should use if there were no alternatives, or what businesses should do if they did not have the space or resources to make extra provision.\n\nShe said: \"There's often unisex provision and where there isn't, as I say, we need to think more broadly about how we make sure those that those facilities are available…\n\n\"If you've got, you know, two self-contained cubicles, one of which is labelled men and one of which is labelled women, then the most sensible thing in those circumstances for a service provider to do is to make both of those unisex.\"\n\nDr Stephenson was appointed to the role in July and she started earlier this month.\n\nIt was greeted with hostility by some trans campaigners, in part because she had donated money to the case of lawyer Allison Bailey, who won part of a tribunal claim that she was discriminated against because of her gender-critical views.\n\nIn our interview, Dr Stephenson was adamant she could still be objective when considering trans issues.\n\nShe said she donated to the case because she was frustrated by situations where \"women were being harassed and losing their jobs on the basis of lawfully held beliefs\".\n\nShe said she had been concerned by the experiences of some women \"when trying to have meetings to discuss proposed changes in the law\".\n\n\"I thought it was important that actually in a democracy, if there is a proposed change to the law, people should be able to meet and discuss those changes without violence or intimidation,\" she said.\n\n\"If that's taking a side, it's taking a side on the side of kind of democratic norms and open discussion and dialogue.\"\n\nThe full interview will be on Sunday with Laura Kuenssberg."
    },
    "https://www.bbc.com/news/articles/c1dzp050yn2o": {
        "source": "BBC News",
        "topic": "crime",
        "title": "Italian parliament unanimously votes to make femicide a crime",
        "content": "Italian parliament unanimously votes to make femicide a crime\n\n26 November 2025 Share Save Sarah Rainsford Southern and Eastern Europe correspondent , Rome Share Save\n\nCorbis via Getty Images Protests against violence against women have taken place across Italy recently, often led by feminist group Non Una Di Meno (Not One Less) - this demonstration took place in Rome on Saturday\n\nDeputies in the Italian parliament have voted unanimously to introduce the crime of femicide – the murder of a woman, motivated by gender – as a distinct law to be punished with a life sentence. In a symbolic move, the bill was approved on the day dedicated to the elimination of violence against women worldwide. The idea of a law on femicide had been discussed in Italy before but the murder of Giulia Cecchettin by her ex-boyfriend was a tragedy that shocked the country into action. In late November 2023, the 22-year-old was stabbed to death by Filippo Turetta, who then wrapped her body in bags and dumped it by a lakeside.\n\nAFP via Getty Images Thousands gathered outside the church where Giulia Cecchettin's funeral was held to pay their respects in December 2023\n\nThe killing was headline news until he was caught, but it was the powerful response of Giulia's sister, Elena, that has endured. The murderer was not a monster, she said, but the \"healthy son\" of a deeply patriarchal society. They were words that brought crowds out across Italy demanding change. Two years on, MPs have voted for a law on femicide after a long and passionately debated session of parliament. It makes Italy one of very few places to categorise femicide as a distinct crime. Introduced by Prime Minister Giorgia Meloni, the law was backed by her own hard-right government as well as opposition MPs. Many wore red ribbons or red jackets to remember the victims of violence. From now on, Italy will record every murder of a woman that is motivated by her gender as femicide. \"Femicides will be classified, they will be studied in their real context, they will exist,\" Judge Paola di Nicola, one of the authors of the new law, said of its significance. She was part of an expert commission that examined 211 recent murders of women for common characteristics, then drafted the femicide law. \"Talking of such crimes as rooted in exasperated love or strong jealousy is a distortion – that uses romantic, culturally acceptable terms,\" the judge argues, surrounded by her research at her home in Rome. \"This law means we will be the first in Europe to reveal the real motivation of the perpetrators, which is hierarchy and power.\" Italy will now join Cyprus, Malta and Croatia as EU member states that have introduced a legal definition of femicide into their criminal codes.\n\nJudge Paola di Nicola helped draft the new law on femicide, the first of its kind in Europe\n\nThere is no agreed worldwide definition of femicide, which makes it hard to count and compare statistics. The Italian law will apply to murders which are \"an act of hatred, discrimination, domination, control, or subjugation of a woman as a woman\", or that occur when she breaks off a relationship or to \"limit her individual freedoms.\" The latest police data in Italy shows a slight fall in the number of women killed last year to 116, with 106 said to be motivated by gender. In future, such cases would be recorded separately and trigger an automatic life sentence, meant as a deterrent. Gino Cecchettin isn't sure such a law would have saved his daughter: her killer was sent to prison for life in any case. But he does think defining and discussing the problem is important. \"Before, many people especially from the centre and extreme right didn't want to hear the word femicide,\" Mr Cecchettin told the BBC. \"Now this is a world where we can speak about it. That's a little step, but it's a step.\" His own focus is on education, not legislation. After Giulia's murder, her father describes taking \"a very intense look into what was happening around me\" then deciding to create a foundation in her name devoted to preventing others suffering as his family have. \"I wanted to understand what had come to [Filippo's] mind,\" Gino Cecchettin explained. \"He was a student, a beloved son. Like a normal guy.\" What he found, he says, was a society full of stereotypes about women and notions of male superiority, and young men struggling to manage their emotions. His daughter's ex-boyfriend had stabbed her to death in a premeditated attack when she refused to get back together with him.\n\nGetty Images Protesters gathered following the death of 14 year-old Martina Carbonaro who was killed by her ex-boyfriend in May 2025\n\nMr Cecchettin now tours Italian schools and universities to talk to young people about Giulia and about respect. \"If we give them the right tools to handle their life they will not act as Filippo, they will probably act in a different manner. They will not stick to the model of the Superman, or the Macho Man,\" is his hope. But getting those 'tools' into schools – in the form of a mandatory course of emotional and sexual education – has not been easy. Far-right MPs have resisted all but optional sex education classes for older children. The Cecchettin Foundation wants them to be obligatory and start early, when young people get access to the internet. The femicide law itself has its critics. When the bill was first presented earlier this year, one group called it a \"poisoned meatball\". \"There is no lack of protection, no legal gap to fill,\" is how law professor Valeria Torre of Foggia University puts it. She believes the new definition of femicide is too vague and will prove difficult for judges to implement. Also, as most women killed in Italy are murdered by current or former partners, proving that the motive is gender will be challenging. \"I am afraid that the government just wants to persuade people it's doing something for the problem,\" she told the BBC. \"What we really need is more economic effort for this problem…to overcome the problems of inequality in Italy.\" Even those who approve of legislating against femicide agree that it must come with far broader measures against gender inequality.\n\nMuseum of the Patriarchy is a temporary exhibition imagining a day when the patriarchy has ended\n\nItaly's problems on that front are currently on display at the Museum of the Patriarchy, a thought-provoking new exhibition in Rome. Italy currently ranks 85th in the Global Gender Gap Index, almost the lowest of all EU states, with just over half of all women in employment, to name just one issue. \"For us, the way to fight against violence against women is to prevent the violence, and to prevent the violence we have to build equality,\" argues Fabiana Costantino of Action Aid Italy, which created the temporary museum to imagine a day when male dominance is consigned to the past. Exhibits include a loudspeaker playing cat calls and a room with the names of women killed by men projected on to a wall. \"There are a lot of forms of violence - like a pyramid,\" Fabiana Costantino says. \"We have to destroy the base in order to destroy the problem in its worst form, which is femicide.\" Tuesday's mammoth session of parliament ended late in the evening in Rome with a final speech by a governing party MP vowing that violence against women \"will not be tolerated, will not go unpunished.\" The law was approved by all 237 deputies and greeted with a burst of applause. \"This shows that on the fight against violence against women, our country has a common political will,\" Judge Paola di Nicola argues, whilst accepting there's a long way still to go. \"It shows that Italy is finally speaking about violence against women having deep roots. The first effect is to make the country discuss something it's never confronted before.\" Additional reporting from Giulia Tommasi"
    },
    "https://www.snopes.com/news/2025/11/26/aborton-dei-lgbtq-human-rights/": {
        "source": "Snopes.com",
        "topic": "LGBTQ",
        "title": "Contextualizing claims State Department declared abortion, DEI and LGBTQ+ rights 'human rights violations'",
        "content": "In August 2025, the U.S Department of State released its annual \"Country Reports on Human Rights Practices,\" which omitted previously reported human rights violations, including \"political freedoms, corruption, gender-based violence, and LGBTQ+ persecution,\" according to Human Rights Watch.\n\nIn November 2025, The Washington Post reported the State Department \"instructed all U.S. embassies and consulates to begin preparing the annual country reports under these and numerous other guidelines that stand in sharp contrast to their historical focus on torture, politically motivated killings and persecution of minority groups.\"\n\nSnopes has been unable to independently verify the reports of these alleged new directives, and the State Department has not replied to requests for comment. However, an independent review of the \"2024 Country Reports on Human Rights Practices\" showed a clear cutback in the incidents reported compared with prior years.\n\nIn late November 2025, online rumors purported that the U.S. Department of State, headed by Secretary of State Marco Rubio, declared that things like access to abortion; diversity, equity and inclusion initiatives; and LGBTQ+ rights would now be considered human rights violations under the administration of President Donald Trump.\n\nUsers on social media, particularly on Facebook (archived, archived) shared the alleged news, with some proclaiming, \"Donald Trump is now trying to redefine human rights as the opposite of human rights.\"\n\nThe rumor suggested the State Department had issued new directives to its embassies across the globe. According to reporting by Reuters:\n\nA senior State Department official said that new instructions to U.S. officials on the report mandate they include \"infringements on human rights in foreign countries,\" including on arrests or official investigations over speech as well as the state subsidization of abortions or abortion drugs and the total estimated number of annual abortions. Officials are also mandated to note the enforcement of diversity, equity and inclusion policies that \"'provide preferential treatment' to workers on the basis of race, sex, or caste.\"\n\nSnopes was not able to independently verify the new guidance delivered to U.S. diplomats, and the State Department has not yet responded to our inquiries, so we have opted not to put a rating on this claim. We will update this article if we learn more.\n\nHowever, credible media outlets such as The Associated Press, The Washington Post, Reuters, Forbes, the BBC, CNN, NPR and NBC News have all reported on the updated directives from the State Department regarding its annual reporting of human rights violations across the globe.\n\nIn sum, reporting indicated the Trump administration upended longstanding practices in what is covered in the State Department's annual \"Country Reports on Human Rights Practices,\" which was released in August 2025, delayed from March 2025.\n\nIn August 2025, the AP reported that \"the delay occurred because the Trump administration decided in March to 'adjust' the reports, which had been compiled during the Biden administration. Among other deletions, the reports do not include accounts from individual abuse survivors or witnesses.\"\n\nFollowing the delay but prior to the report's release, NPR wrote that State Department employees were \"directed to 'streamline' the reports by stripping them down to only that which is legally required\" so as to align them with U.S. policy and executive orders issued by Trump.\n\nThe August 2025 report signified apparent changes in what the U.S. considered human rights violations, but according to media reports, official updated guidance was delivered to diplomats in November 2025, sparking the wave of social media posts on the subject.\n\nSnopes' independent review of the 2024 report showed significantly scaled-back information compared with years prior. This included the lack of any introduction from Rubio, a summary of the report from the department's figurehead that had been present in past years.\n\nInstead, the administration is reportedly turning the focus of the report to \"emphasizing entitlements 'given to us by God, our creator' and issuing new guidance for U.S. diplomats to scrutinize the prevalence of abortion and gender-transition surgery among children,\" according to The Washington Post.\n\nThe Post further reported that courts in the U.S. — and outside of the country — frequently rely on these reports, which cover 198 countries and have been compiled for about five decades. Indeed, the report was first mandated in 1974 and reports as far back as 1999 are available to view on the State Department's website.\n\nMultiple outlets reported an identical statement from State Department deputy spokesperson Tommy Pigott in which he said of the updates, \"In recent years, new destructive ideologies have given safe harbor to human rights violations. The Trump administration will not allow these human rights violations, such as the mutilation of children, laws that infringe on free speech, and racially discriminatory employment practices, to go unchecked.\"\n\n\"Mutilation of children\" is a reference to transgender youth, and \"racially discriminatory employment practices\" refers to DEI initiatives, both of which have been publicly targeted by the Trump administration.\n\nIn addition, the BBC reported that the new instructions also said countries that subsidize abortion or facilitate mass migration are infringing on human rights.\n\nHuman Rights Watch, a nonprofit organization that \"investigates and reports on abuses happening in all corners of the world,\" wrote of the Trump administration's updates:\n\nOn August 12, 2025, the State Department released its 'Country Reports on Human Rights Practices' covering the year 2024. The report omits several categories of rights violations that were standard in past editions, including women, LGBT people, persons with disabilities, corruption in government, and freedom of peaceful assembly. The administration has also grossly mischaracterized the human rights records of abusive governments with which it has or is currently seeking friendly relations.\n\nHuman Rights Watch pointed to the report's categorization of the war in Gaza, in which the \"State Department disregards the Israeli authorities' mass forced displacement of Palestinians in Gaza, their use of starvation as a weapon of war, and their deliberate deprivation of water, electricity, medical aid, and other goods necessary for civilians' survival, actions that amount to war crimes, crimes against humanity, and acts of genocide.\"\n\nFurther, the organization argued, \"The State Department also fails to mention vast damage and destruction to Gaza's essential infrastructure and the majority of homes, schools, universities, and hospitals.\"\n\nIndeed, an independent review of the \"2024 Country Reports on Human Rights Practices: Israel, West Bank and Gaza\" revealed no mention of the above. Further, a section of the report under the subheading \"War Crimes, Crimes against Humanity, and Evidence of Acts that May Constitute Genocide, or Conflict-related Abuses\" featured only one sentence: \"Terrorist organizations Hamas and Hizballah continue to engage in the indiscriminate targeting of Israeli civilians in violation of the law of armed conflict.\"\n\nIn comparison, the same section of the 2023 report ran nearly 2,000 words, including detailed coverage of the conditions of prisons and detention centers.\n\nOther changes were highlighted by the Congressional Equality Caucus, a collection of members of the United States House of Representatives who aim to \"promote equality for all people regardless of sexual orientation, gender identity, or sex characteristics.\"\n\nFor instance, the caucus pointed out that \"the report says there 'were no credible reports of significant human rights abuses' in Hungary in 2024, even though Prime Minister Viktor Orbán's government continued its anti-LGBTQ rights crackdown.\" Reporting from the AP in 2024 showed growing backlash from the European Union to the Hungarian government's anti-LGBTQ+ stance, which continued with legislation passed in March 2025 that would allow for the banning of LGBTQ+ Pride events.\n\nThe caucus also said the report did not accurately reflect what would traditionally be classified as human rights violations in years past, such as \"Uganda's Anti-Homosexuality Law\" and that \"Brazil has the highest number of reported murders of transgender people in the world.\"\n\nBased on the reporting available, it appeared the State Department, through omission and changes in reporting requirements, attempted to modify what would be considered a human rights violation from the perspective of the U.S. government. However, as we have not been able to independently review the alleged document outlining the policy change, we have opted to leave this claim unrated."
    },
    "https://www.vox.com/policy/470780/gender-men-masculinity-women-birthrates-relationships-gender-childcare-chores": {
        "source": "Vox",
        "topic": "feminism",
        "title": "Traditional gender roles won’t get men what they want",
        "content": "is a senior policy correspondent for Vox covering social policy. She focuses on housing, schools, homelessness, child care, and abortion rights, and has been reporting on these issues for more than a decade.\n\nA man with a baby carriage on July 15, 2025, in Madrid, Spain. Births in Spain have fallen by 38 percent since 2008, making it the third largest drop in the European Union behind Latvia (41 percent) and Greece (40 percent). Jesus Hellin/Europa Press via Getty Images\n\nFor years now, falling birth rates have been a subject of alarm, with most of that discussion focused on women — the factors preventing them from having kids, whether mothers can balance work and family, if feminism has led women astray.\n\nBut what about men and what they think?\n\nDemographers focused on fertility trends have largely ignored men’s attitudes toward gender, caregiving, and relationships. We have far less data on men’s perspectives than women’s and even less on how those viewpoints shape outcomes.\n\nBut, men do have opinions on these topics, even if we haven’t examined them all that closely. American men are more likely to see falling birth rates as a problem, for example, and also more likely to want a return to “traditional gender roles.” Nearly six in 10 men favor such a return, according to recent polling from the 19th News, compared to just four in 10 women. Among Republican men, that figure stood at 87 percent.\n\nThese attitudes aren’t just showing up in polls — they’re shaping policy and discourse. A growing number of conservatives have started to publicly lament that women’s equality may have been a bridge too far, with some calling for an end to no-fault divorce or suggesting it’s time to get rid of women’s right to vote. Even the New York Times, a mainstream and liberal publication, recently ran a segment titled, “Did Women Ruin the Workplace?” discussing whether women have made professional culture too emotional and unserious.\n\nIt’s easy to feel like men and masculinity have gotten plenty of attention already, and there has certainly been reticence on the left to centering men’s desires at all. It’s not hard to understand these reservations. Men have been prioritized for most of human history, and still dominate positions of power.\n\nBut, understanding men’s attitudes remains essential. Everyone wants identity and purpose. For many men, these basic needs can manifest through a desire to feel masculine, and so their attitudes toward gender and caregiving are shaped by these deeper beliefs about what it means to be a man. If caregiving is seen as overly feminine work that diminishes masculinity, men will resist it.\n\nFor anyone who cares about gender equality, about women being able to find partners they want, or about people who want families being able to build them, ignoring what men think and need guarantees failure on every front.\n\nIt’s not just about chores\n\nWhen it comes to gender equality and babies, activists and politicians have long argued that more of the first would lead to more of the second. Or, as a former Tory minister in the United Kingdom once quipped, “Feminism is the new natalism.” The optimistic theory was that, if men stepped up, and egalitarian policies like paid leave became more widespread, birth rates would rise.\n\nThere’s some truth to this, in the sense that research suggests a lack of gender equality makes the birth rate fall even faster.\n\nToday, women with economic independence and less social pressure to marry are more likely to remain single than to settle for partners they don’t trust to be supportive. “It used to be that women felt like they had no other choice — like maybe this guy’s not great but he’s the best that’s going to come along,” said Patrick Brown, a family policy analyst at the conservative Ethics and Public Policy Center. “But now...women are willing to stay single if they don’t meet somebody who matches their criteria.”\n\nAnd since most people who have kids these days do so in long-term, committed relationships, men who fail to demonstrate they’d be good partners face lower odds having kids at all.\n\nTelling women to stay home isn’t a guarantee they’ll have more kids, either. Across most countries, women who work “are more likely to have children than those not employed,” said Trude Lappegård, a sociologist at the University of Oslo. This is true even when their partners are also employed.\n\nIn South Korea and Japan, where women are expected to do nearly all the domestic labor and must navigate workplaces that heavily penalize motherhood, fertility rates have imploded. South Korea’s birth rate hit 0.75 children per woman in 2024, the lowest in the world, while Japan’s dropped to 1.15. A similar trend exists across Southern Europe. In Italy, Spain, and Greece, where traditional gender norms remain strong, fertility has sunk to between 1.1 and 1.3.\n\nThese patterns show up in broader data, as well. A 2025 study analyzing over 40 European countries found that women increasingly want men to share child care and housework equally, while men’s beliefs that women should handle the unpaid, domestic work have remained largely unchanged. In countries where this gap was widest, both birth rates and female employment were lower — suggesting that men’s resistance to sharing chores may be holding both back.\n\n“Of course this is not the only explanation — there are many factors that affect fertility — but we’re saying not having men recognizing their share in the household does have an impact on women choosing to have children or not,” study co-author Giulia Briselli told me.\n\nThe equation isn’t as simple as men doing more at home and birth rates going up. Men have clearly increased their time doing child care and domestic chores compared to generations past while fertility has continued to drop. “Pressuring men to help out more at home won’t help fertility,” Lyman Stone, a conservative demographer at the Institute for Family Studies, argued this summer.\n\nStill, it’s more nuanced than that. Nordic countries that restructured parental leave, provided free child care, and created more flexible workplace norms that pull men into caregiving have higher fertility. Their rates hover around 1.4 to 1.6 — still well below replacement, but better. In Norway, Iceland, and Sweden, fathers who used their countries’ parental leave policies were more likely to have partners who welcomed a second child. Gender equality isn’t a magic fix, but doubling down on traditional roles seems to make things worse, not better.\n\nIndeed, Briselli’s work found that, in countries where the gap between men’s and women’s attitudes about sharing child care and housework was smallest, both fertility rates and female employment were higher. What seems to matter most may not be hours logged on chores but whether women perceive the arrangement as fair. And, even Stone’s own data showed that when women’s sense of unfairness increases, fertility falls. It’s not just what men do at home, but whether they see it as their responsibility or as a favor.\n\nThe research gap\n\nThis very question — of how men feel toward their obligations at home — is not well-studied. “This part was definitely not well-documented, not much attention has been paid to it, and I think we should put more light on it, for sure,” Briselli said.\n\nLappegård, the sociologist in Oslo, agreed and told me there’s been a general lack of interest in studying men among demographers in her field. “I’ve been screaming that we need more research about men for the last 20 years,” she told me. “If we want to really understand what’s going on with women then we not only have to compare them with men, but also men have their own independent voice in this.”\n\nThis knowledge gap exists partly because many scholars have seen the study of men and masculinity as inherently conservative — a pretext to rolling back women’s rights or centering men’s wounded feelings over women’s material concerns.\n\nBut, if we want to understand why men’s attitudes toward sharing domestic work have stagnated even as women’s expectations have shifted, then we’ll need to delve deeper into questions about how men see their place in the world. And if we want to ultimately move towards more equality and connection, then the question of what masculinity can and should be isn’t one we can avoid.\n\nFilling the bigger void\n\nAs concern about the mental health of men has grown, so has a debate about whether masculinity can be salvaged or if it’s fundamentally oppressive. Some argue for redefining it in more humane terms, so that engaged fathers and emotionally available partners are considered masculine; others push back hard. The idea that a more positive masculinity could even exist is “an attempt to scrub away the humiliating stain of womanhood from any trait or behavior before letting boys anywhere near it,” argued Ruth Whippman in the New York Times.\n\nDoing so, echoed Jessica Winter in a recent New Yorker piece, would be conceding that “men should still rank above women in the social hierarchy, just not as much as before.” Both women propose a world where we scrap masculinity in exchange for “full humanity” and a “gender-free” world.\n\nThese exhortations, though, strike me as wishful thinking. Dismissing positive visions of masculinity certainly wouldn’t eliminate the demand for masculinity; the hunger for a sense of identity doesn’t just disappear. Practically speaking, it just creates a void for the Andrew Tates and Jordan Petersons of the world to fill more easily.\n\nAnd few people are calling to abolish femininity. There are critiques, certainly, of its more toxic elements — like dangerous pressures to be thin, or encouragements to go under the knife — but it’s rare to hear feminists call for women to reject femininity altogether. Instead, the movement has worked to educate women on the more harmful aspects of femininity while widening space in womanhood for those who don’t conform and allowing women who want to embrace traditionally feminine activities to do so.\n\nWe can do for men what feminism did for women: name the harmful pressures, expand what counts as being a “good” man in society, and free people from the norms that make them less healthy and less connected. The valorization of dominance, the stigma around asking for help, and the equation of manhood with control needn’t be the future of masculinity.\n\nDaniel Cox, the director of the Survey Center on Family Life at the American Enterprise Institute, thinks part of the appeal of traditional gender roles is that they offer men clarity — a sense that there’s a defined place for them and that they’re needed. “The primary messaging that all these men are hearing is that no one needs you, women can do it on their own,” he told me. It’s a message that leaves men confused and unmoored.\n\nIn response, Cox pointed to “relational masculinity” as an idea that could help men and that might also be more compatible with what women are looking for in partners.\n\n“I think a lot of newly married husbands and new dads feel that weight of responsibility to protect and provide for their family and it can give you a lot of meaning,” he said. “Otherwise you might say why am I grinding, right? But when you’re doing it on behalf of someone else and someone needs you, it’s incredibly motivating…I think we’ve just fundamentally lost that idea of being in service to each other, whether it’s to your family, your community, or country.”\n\nWhile some women will roll their eyes at the idea of men wanting to feel needed, if we’re being honest, that’s a deeply human, universal desire. In one recent study of over 3,000 Americans, people who believed they were needed — whether by their family, their work, or their community — reported being significantly happier and more satisfied with their lives. It wasn’t about egotism; it was about having a sense of purpose from something outside yourself.\n\nThe future can be different\n\nIt’s not a total mystery why the gender revolution has stalled; incorporating caregiving into masculine identity asks men to give up some advantages and embrace work that’s long been seen as feminine and undervalued. But countries like France — where Briselli found that men’s and women’s views on sharing housework are surprisingly aligned — show that it’s possible for men to see engaged fatherhood and domestic labor not as reluctant helping but as something core to being a good man. Even in the US, things are changing. Roughly 20 percent of American parents report being in genuinely egalitarian partnerships.\n\nAnd women aren’t going back to the 1950s. They’re not giving up their educations, careers, or staying in relationships that don’t feel like partnerships. The data suggests that, even if they did, fertility would only fall faster.\n\nWhether society-wide fertility can ever rise again under conditions of gender equality remains genuinely uncertain; researchers like Lappegård say they have more questions right now than answers. But what’s at stake is far more than birth rates — it’s whether men and women can actually build lives together."
    },
    "https://hackaday.com/2025/11/25/the-zen-must-flow-from-arrakis-sand-table/": {
        "source": "Hackaday",
        "topic": "religion",
        "title": "The Zen Must Flow From Arrakis Sand Table",
        "content": "In Dune, the Fremen people of Arrakis practice an odd future hybrid religion called “zensunni.” This adds an extra layer of meaning to the title of [Mark Rehorst]’s Arrakis 3.0 sand table, given that the inspiration for the robotic sand table seems to be Zen gardens from Japan.\n\nThe dunes on the tabletop version of Arrakis owe nothing to sand worms, but are instead created a rolling metal ball. With all workings happening below, it looks quite magical to the uninitiated, but of course it’s not magic: it’s magnets. Just beneath the tabletop and its sands, the steel ball is being dragged along by the magnetic field of a powerful neodynium magnet.\n\nThat magnet is mounted in a CoreXY motion system that owes more than a little bit to modern 3D printers. Aside from the geometry, it’s using the standard G6 belt we see so often, along with a Duet3D mainboard, NEMA 17 steppers, and many 3D printed parts to hold its aluminum extrusions together. Thanks to that printer-inspired motion system, the ball can whirl around at 2000 mm/s, though [Mark] prefers to run slower: the demo video below shows operation at 1000 mm/s before the sand has been added.\n\nThis build was designed for ease of construction and movement: sized at 2’x4′ (about 61 cm x 122 cm), it fits through doors and fits an off-the-shelf slab of coffee table glass, something that [Mark] wishes he’d considered when building version two. That’s the nice thing about jumping in on a project someone’s been iterating for a while: you’ve got the benefit of learning from their mistakes. You can see the roots of this design, and what has changed, from the one he showed us in 2020.\n\nNaturally you’re not limited to CoreXY for a sand table, though it is increasingly popular — we’ve seen examples with polar mechanisms and even a SCARA arm."
    },
    "https://www.bbc.com/news/articles/cpvd4exxlpzo": {
        "source": "BBC News",
        "topic": "religion",
        "title": "Sir Andreas Whittam Smith, co-founder of the Independent, dies aged 88",
        "content": "Sir Andreas Whittam Smith, co-founder of the Independent, dies aged 88\n\nIn a tribute to the man who he described as \"a radical and a pioneer\", Rajan wrote that Sir Andreas had \"profoundly transformed British journalism for the better, and forever.\"\n\nIt was the first paper not to have a permanent allegiance to a political party - \"a thrilling moment in the history of Fleet Street\", according to the BBC's Amol Rajan, who served as editor of the paper starting in 2013.\n\nThe Daily Telegraph financial journalist oversaw the publication's birth in 1986 with colleagues Stephen Glover and Matthew Symonds.\n\nThe founder of The Independent newspaper, Sir Andreas Whittam Smith, has died aged 88, his family announced.\n\nA family spokesperson announced Sir Andreas's death on 29 November, saying that he was \"surrounded by family until the end\" and that he would be \"dearly missed\".\n\nHe is survived by his wife, two children and three grandsons.\n\nSir Andreas worked at a range of British papers including the Financial Times, The Guardian and The Daily Telegraph before founding The Independent.\n\nThe paper was \"the zeitgeist of print\", Rajan said in his tribute, and \"embodied Thatcher's Britain - though not her politics\".\n\nHe recalled an advertising campaign with the slogan: \"The Independent. It is. Are you?\". The paper said it was \"of no party or faction\" and boasted \"a tinge of republicanism\".\n\nReligion played an important role in Sir Andreas's life. He served as First Estates Church Commissioner from 2002 to 2017, in charge of the committee that oversees the Church of England's multi-billion pound investment portfolio.\n\nThe Independent notes that he was seen as a \"saintly\" and \"ecclesiastical\" figure on Fleet Street.\n\nHe was also formerly the President of the British Board of Film Classification, requiring him to approve and rate films for release, including approving a remake of Lolita.\n\nSir Andreas told the BBC in 2002 how he had been described as an \"urbane liberal\" by the Daily Mail for this controversial move \"and I was so pleased with the 'urbane'.\"\n\n\"That's the only thing I can set against the wretched bishop image.\"\n\nHe was made a Commander of the British Empire in 2002 and knighted in 2015 for his public service, \"particularly to the Church of England\"."
    },
    "https://www.bbc.com/news/articles/cwyv57geklko": {
        "source": "BBC News",
        "topic": "religion",
        "title": "King's support for persecuted Christians in Advent service",
        "content": "King supports persecuted Christians in Advent service\n\n10 December 2025 Share Save Sean Coughlan Royal correspondent, Westminster Abbey Share Save\n\nPA Media King Charles attended a candle-lit service with guests from many faiths\n\nKing Charles remembered the plight of Christians facing persecution around the world, as he attended an atmospheric, candle-lit Advent service at Westminster Abbey. The service, with a strong Orthodox Christian influence, along with Anglican and Catholic prayers, warned against religious discrimination, with a message from the King supporting those \"in areas where it is not easy to live out one's faith\". There was also a seasonal message of hope in the winter gloom, with the King hailing \"the light, hope and, above all, the peace of this season\". The King particularly seemed to enjoy the Advent hymn, O Come, O Come, Emmanuel, which he described in the Order of Service as \"magnificent\".\n\nPA Media King Charles spoke to Cardinal Timothy Radcliffe, who gave the sermon\n\nThe service, conducted by the Dean of Westminster, the Very Reverend Dr David Hoyle, brought together a range of representatives of Christian denominations, including the Most Reverend Hosam Naoum, the Anglican Archbishop of Jerusalem and the Middle East. It was a meditative service marking the approach of Christmas, and in many ways it was unorthodox, as well as Orthodox, with a colourful range of religious robes and a rich mix of different languages and musical styles. The sermon was given by Cardinal Timothy Radcliffe, a senior Catholic clergyman, who spoke of the importance of rejecting intolerance and the \"massive persecution of Christians in so many places\". He remembered the death of a bishop in Algeria, Pierre Claverie, who had been killed by Islamist extremists in 1996, and who was later mourned by both Christians and Muslims. Cardinal Radcliffe said \"pointless violence had flowered into friendship\". The congregation also heard the testimony of Ribqa Nevash, who spoke of the pressure on Christians in present-day Pakistan, saying churches had been burned and Christians had faced discrimination because of their religion. The 25-year-old, originally from Faisalabad, said she was relieved to be in the UK where she could openly celebrate Christmas.\n\nPA Media Icons were on display inside Westminster Abbey\n\nReuters Orthodox clergy were part of the Advent service at the Abbey"
    },
    "https://www.popularmechanics.com/science/archaeology/a69699441/ancient-lost-temple-peru-discovered/": {
        "source": "Popular Mechanics",
        "topic": "religion",
        "title": "Archaeologists Found a Lost Temple in the Sand That Solves a Major Historical Puzzle",
        "content": "Here’s what you’ll learn when you read this story:\n\nArchaeologists uncovered a 4,000–5,000-year-old ceremonial temple in Peru, revealing ancient walls, friezes, and a central staircase likely used for early ritual performances.\n\nThe team also found three adult skeletons and a possible offering, offering new clues about early religious practices and a little-known culture that existed before documented Andean civilizations.\n\nA second, later temple from 600–700 A.D. was also discovered, including the remains of a young child, showing how complex belief systems evolved in the region across thousands of years.\n\nArchaeologists recently found the lost ruins of a ceremonial temple—covered in sand and 4,000 to 5,000 years old—in northwestern Peru. The excavation team first discovered the walls, and subsequently unearthed a mix of features indicating that the structure was once a temple. And then came the skeletal remains of three adults tucked between walls.\n\n“We may be facing a 5,000-year-old religious site that constitutes an architectural space defined by walls built by rammed earth,” Luis Armando Muro Ynoñán, director of the Cultural Landscapes Archaeological Project of Ucupe — Valle de Zaña, said in a translated statement from the Peruvian Ministry of Culture.\n\nThe oldest portion of the site features not only the up-to-5,000-year-old walls, but also various architectural features that help define the site as a ceremonial temple. “We have what would have been a central staircase from which one would ascend to a kind of stage in the central part,” Muro Ynoñán said, noting that the stage could have hosted ritual performances in front of an audience.\n\nThe ruins include friezes with images of cats, the claws of a reptile, and a human body with the head of a bird. The designs are preserved in “fine plaster,” which has helped scientists nail down the exact age of the site and the origins of the religion. The team plans to study the chemical makeup of the pigments in the murals painted on the walls to help confirm how old the site is this fall.\n\nBut it wasn’t just architecture located in these sand dunes—there were human remains, too. According to Reuters, the excavation team located the remains of three adult bodies positioned between the walls of the temple. Nearby was also a bundle wrapped in linen that potentially served as an offering.\n\n“It was amazing,” said Muro Ynoñán, according to a statement from the Field Museum in Chicago. “This discovery tells us about the early origins of religion in Peru. We still know very little about how and under which circumstances complex belief systems emerged in the Andes, and now we have evidence about some of the earliest religious spaces that people were creating in this part of the world.”\n\nRelated Story Tiny Humans Are Hiding in Indonesia, Scientist Claims\n\nMuro Ynoñán said that the newfound temple likely contains more information about a people group that predated the known inhabitants of the region. “We don’t know what these people called themselves,” he said, “or how other people referred to them. All we know about them comes from what they created: their houses, temples, and funerary goods.”\n\nThe excavation team was invited to the site after the local government observed looting in the area. “It was so surprising that these very ancient structures were so close to the modern surface,” Muro Ynoñán said. “We think that a large temple was built into the side of the mountain, and we’ve found one section of it.”\n\nArchaeologists also found a more recent temple, dated to sometime between 600 and 700 A.D. Muro Ynoñán believes the second site comes from the Moche culture. This one also features remains—those of a young child, possibly between 5 and 6 years old—but from a more recent time.\n\n“The people here created complex religious systems and perceptions about their cosmos,” Muro Ynoñán said. “Religion was an important aspect of the emergence of political authority.”"
    },
    "https://www.bbc.com/news/articles/cvgk1l4lrrdo": {
        "source": "BBC News",
        "topic": "crime",
        "title": "Special Forces heads suppressed SAS war crime evidence, inquiry hears",
        "content": "SAS war crime evidence suppressed, inquiry hears\n\n1 December 2025 Share Save Joel Gunter, Hannah O'Grady & Rory Tinman Share Save\n\nBBC\n\nTwo former heads of all UK Special Forces suppressed evidence of possible SAS war crimes, a former high-ranking officer has told a public inquiry in closed evidence sessions. The officer, who was among the most senior in special forces, said he had passed what he called \"explosive\" evidence suggesting \"criminal behaviour\" to the then-director special forces in 2011. He also told the inquiry that the subsequent director special forces, who took over in 2012, \"clearly knew there was a problem in Afghanistan\" and failed to act. The claims come from testimony published on Monday by the Independent Inquiry relating to Afghanistan, which is examining allegations the SAS murdered detainees and unarmed civilians, including children, during operations.\n\nThe officer giving evidence is known at the inquiry by the cipher N1466. His testimony is significant because he is highest-ranking former special forces officer to allege that evidence of war crimes was suppressed by those leading the SAS. It was \"not just one director that has known about this\", N1466 said in his evidence, adding that UK Special Forces leadership was \"very much suppressing\" the allegations. He confirmed to the inquiry that neither of the two former heads of special forces had passed any of the troubling allegations on to the Royal Military Police (RMP), despite British law requiring commanders to inform the RMP of any possibility someone under their command may have committed a serious criminal offence. The inquiry's reporting restrictions mean the former directors accused by the officer cannot be named.\n\nThe Afghan inquiry was launched in the wake of allegations of unlawful killings by the SAS, reported by BBC Panorama in 2022. The programme revealed that 54 detainees and unarmed men had been killed by the SAS in suspicious circumstances in just one six-month tour. The programme also found evidence that the director special forces in 2012, General Sir Mark Carleton-Smith, had failed to report war crimes. At the outset of the inquiry, both Gen Carleton-Smith and Lt Gen Jonathan Page, the preceding director special forces, were named in proceedings in relation to claims they had failed to inform the RMP of the allegations.\n\n'Criminal behaviour'\n\nN1466 told the inquiry he had first become concerned back in February 2011, after noticing that SAS reports coming back from Afghanistan showed the regiment was killing people in suspicious circumstances and in unusually high numbers, with too few enemy weapons recovered from some operations to justify the number of deaths. N1466 said his suspicions began with a night raid on which nine Afghan men were killed and just three weapons were claimed to have been discovered. BBC Panorama visited the scene of that raid years later, in 2022, and found bullet holes inside the room where the men died clustered close to the ground. Weapons experts told the Panorama that the pattern suggested the victims had been shot while they were lying down, and that the firefight described by the SAS in their report was unlikely. The family said they were civilians, and had no weapons at their home.\n\nBBC Panorama visited the scene of a raid in 2022\n\nN1466 also told the inquiry he had been made aware of whistleblower testimony that SAS troopers had been heard bragging during a training course about killing all \"fighting-age\" males during operations, regardless of whether they posed a threat or not. Together with the operational reports, N1466 was left \"deeply troubled by what I strongly suspected was the unlawful killing of innocent people, including children,\" he testified. \"I will be clear, we are talking about war crimes,\" he said. In response, in April 2011, N1466 commissioned a review from another officer at special forces headquarters of recent SAS operations. The results looked \"startlingly bad\" for the SAS, he told the inquiry. The review formed part of the evidence he presented to the then-director special forces in 2011. He said he \"indicated quite clearly to him\" that \"there was a strong potential of criminal behaviour.\" N1466 testified that the director \"absolutely knew what was happening\" in Afghanistan with regard to the alleged war crimes, and \"absolutely knew what his responsibilities were\" when it came to reporting the allegations to military police. The director did not contact police, but instead ordered an internal review of the SAS squadron's tactics – a move N1466 described as a \"warning shot\" to the squadron to tone down the violence. The director had made \"a conscious decision that he is going to suppress this, cover it up and do a little fake exercise to make it look like he's done something,\" N1466 said. The subsequent \"tactics, techniques and procedures\" review was conducted by an SAS officer, who visited Afghanistan but spoke only to other members of the Regiment. The resulting report fully accepted the accounts of those suspected of carrying out the unlawful killings.\n\nHabibullah previously told BBC Panorama his two young sons were killed in a raid in 2011\n\nBruce Houlder KC, who as a former director of service prosecutions was responsible for bringing charges and prosecuting those serving in the armed forces, told the BBC that the law \"imposed a very clear duty\" on commanding officers to report suspected crimes, \"including murder, which we are talking about here\". \"If this came to my knowledge I would have asked the service police to investigate the DSF for that failure to report in 2011,\" he said. N1466 eventually reported the evidence directly to the Royal Military Police in January 2015, nearly four years after he had first raised his concerns and only after the RMP had begun Operation Northmoor, an investigation into the SAS. He told the inquiry it was \"a matter of great regret\" that he had not gone sooner to the RMP, nor urged the director to refer the evidence to the RMP – a move which he said he viewed at the time as stepping out of line. \"When you look back on it, on those people who died unnecessarily from that point onwards – there were two toddlers shot in their bed next to their parents, you know – all that would not... necessarily have come to pass,\" he said. He was referring to an SAS raid in Nimruz province in August 2012 which was first uncovered by the BBC, on which two young parents were fatally shot while in bed with their infant sons, who were also shot and gravely wounded. The raid, which occurred after the new director special forces had taken over, was never reported to the military police. The director who took over in 2012 told the BBC that the allegations made by N1466 were refuted and that he would provide a comprehensive response to each of these matters in his evidence to the inquiry in due course. He said that none of his senior commanders expressed any concerns or produced any evidence of unlawful killings at any stage of his three years in charge and that there was no allegation or evidence he was aware of to refer to the RMP. The former officer who was director special forces in 2011 did not respond to a request for comment. Tessa Gregory of law firm Leigh Day, who represents the Afghan families at the inquiry, said they were \"grateful to this officer for giving such candid testimony\". \"They are extremely concerned to hear that many of the soldiers who were on the ground during the operations are currently refusing to give evidence to the inquiry by relying on the right to privilege against self-incrimination,\" she said in a statement. \"They hope that others will follow this officer's lead so that they can find out the truth of what happened to their relatives.\" Col Richard Williams, commanding officer of the SAS between 2005 and 2008, told BBC Radio 4's Today programme that N1466's evidence was \"the critical opinion of one\" and \"gives a rather unbalanced picture\" and should be seen alongside that of those \"commanding the troops on the ground\". He added: \"I think for all observers - critics, those concerned, reporters, the general public - would prefer to have a more balanced position shared, don't you?\" Former veterans' minister Johnny Mercer told the same programme he believed the release of N1466's evidence \"fit[s] a certain narrative\" of soldiers behaving badly, and urged caution against \"reading only one side\". Mercer, also a former British Army officer, said: \"I think people do support it [the inquiry] because actually the military isn't full of people who want to go out and break the law and murder civilians and children, and actually the vast majority, and certainly everyone I engaged with, demonstrated the best of the qualities that we know the UK Armed Forces is for.\" A spokesperson for the inquiry said it was \"investigating the deliberate execution of Afghan males, it's not about split second decisions taken in combat.\" The inquiry was \"legally required to publish what evidence we can, when we can,\" the spokesperson added.\n\nDo you have information about this story that you want to share? Get in touch using SecureDrop, a highly anonymous and secure way of whistleblowing to the BBC which uses the TOR network. Or by using the Signal messaging app, an end-to-end encrypted message service designed to protect your data. SecureDrop: http://kt2bqe753wj6dgarak2ryj4d6a5tccrivbvod5ab3uxhug5fi624vsqd.onion/ WhatsApp / Signal: 0044 7815 653 458 Please note that the SecureDrop link will only work in a Tor browser. For information on keeping secure and anonymous, here's some advice on how to use SecureDrop."
    },
    "https://www.bbc.com/news/articles/cm2895pgm99o": {
        "source": "BBC News",
        "topic": "crime",
        "title": "'Gang in balaclavas targeted our combine harvester': Farmers welcome rural crime crackdown",
        "content": "'Gang in balaclavas targeted our combine harvester': Farmers welcome rural crime crackdown\n\n25 November 2025 Share Save Malcolm Prior Rural affairs producer Share Save\n\nWilliam Maughan William Maughan's farm was one of four broken into in one night by a balaclava-clad gang of thieves\n\nEarly this summer a gang dressed in black and wearing balaclavas approached an isolated farmhouse in County Durham as a couple in their 80s slept inside. They'd been staking out the property and knew exactly what to steal from the vehicles parked outside – a combine harvester's expensive GPS equipment that could be smuggled abroad. The farming family had fallen victim to what police say is increasingly brazen organised crime. The National Police Chiefs' Council (NPCC) said on Tuesday it was launching a new three-year crackdown that would help target the 20-plus gangs said to be currently operating across the countryside.\n\nThe government said the new policing strategy would be a \"vital step\" in tackling rural crime. The NPCC said this year alone more than 155 arrests linked to rural organised crime gangs had been made, with nearly £13m worth of stolen farm equipment seized, some of which had been recovered from abroad, mostly from Eastern Europe. The National Farmers' Union (NFU) said that criminal gangs had been targeting farmers' machinery, livestock and land for \"too long\" and there needed to be more help from specialist rural police officers. One of the farms targeted belonged to William Maughan, a beef, poultry and arable farmer in County Durham whose parents live on the premises. He said his was one of four farms in the local parish that were broken into on the same night. Mr Maughan, a father of two, said the gang cut out GPS systems from vehicles on the farms, including from his combine harvester. His parents, both aged 80, slept through the break-in. He told the BBC: \"It was very targeted. They knew exactly which equipment to take. They knew how to get into the farm where the combine was. \"There's obviously been a lot of work done in advance to plan it and it's not a nice feeling when that happens. It feels like you're a target and could you be targeted again? \"The thought of coming across someone stealing equipment - in the early hours of the morning, fully balaclava'd-up and in dark clothing - where you live, where your children are, it's not nice.\" Since the break-in Mr Maughan has had to pay out for improved security measures at the farm. \"We're in the rolling countryside, in sleepy south Durham, so to be the victim of potentially international crime like this is quite hard to believe and it is quite shocking really,\" he said.\n\n'Robust response'\n\nThe most recent crime report by insurers NFU Mutual shows that the estimated cost of all rural crime decreased by 16.5% year-on-year, to £44.1m in 2024, as you can see from the graph below, although it rose sharply in Wales.\n\nThese figures, however don't tell the whole story. The estimated cost of tractor thefts alone rose by 17% to £1.5m, suggesting that some criminals are taking a more targeted approach. The Country Land and Business Association (CLA), which represents rural businesses and landowners, said that farmers \"have had enough of criminals and violent organised gangs targeting them\". The scale of the police response to those gangs was revealed on Tuesday with the launch of a new nationwide rural and wildlife crime strategy that outlines how police will tackle all countryside crime over the next three years. The NPCC said it would use intelligence-led policing, data analysis and crime mapping to identify crime hotspots and target resources to where organised crime groups were operating most often. A spokeswoman for the NPCC said organised criminal gangs were \"bringing a level of sophistication and menace that demands a robust and coordinated response\". As well as machinery theft, the strategy also identifies eight other priority crime areas, including livestock worrying and theft, illegal hunting and poaching and crimes committed against protected species such as badgers, bats and birds of prey. Rachel Hallos, vice-president of the National Farmers' Union (NFU), welcomed the strategy \"as recognition of the serious and organised nature of rural crime\". \"But delivery is key: farmers need visible policing, swift recovery of stolen equipment and sentencing that deters repeat offenders,\" she added. Crime and policing minister Sarah Jones said rural crime \"can wreak havoc on the livelihoods of farmers and countryside communities.\". \"This strategy is a vital step in our mission to deliver safer streets everywhere and comes as we give the police new powers to take on the organised criminal gangs targeting the agricultural sector,\" she said. The minister added that rural areas would see more \"visible policing\" in the future."
    },
    "https://www.bbc.com/news/articles/c8030m1g2ygo": {
        "source": "BBC News",
        "topic": "crime",
        "title": "Friday-night drug deals helping Russian war machine, UK crime agency warns",
        "content": "Friday-night drug deals helping Russian war machine, UK crime agency warns\n\n21 November 2025 Share Save Daniel Sandford UK correspondent Share Save\n\nNational Crime Agency George Rossi, who heads up TGR, with his second in command Elena Chirkinyan\n\nBuying cocaine on a Friday night in Britain can indirectly help Russian arms factories, the National Crime Agency (NCA) has warned. The NCA said a man linked to a Russian-led money-laundering network operating in the UK had bought a bank in Kyrgyzstan which was used to make payments on behalf of the Russian war machine. Sal Melki, the agency's Deputy Director for Economic Crime, said it was a \"vast criminal ecosystem that is funding some really bad things all around the world\". The NCA is trying to disrupt the network from top to bottom, even putting adverts in UK motorway service station toilets to warn couriers carrying cash for the money-launderers of the lengthy jail sentences they face.\n\nThe investigation into Russian money laundering is called Operation Destabilise. Last year the NCA said it had identified two networks called TGR and Smart that worked together to process cash for drugs gangs, suppliers of illegal firearms and people smugglers. Investigators have now discovered that George Rossi, who heads up TGR, bought a bank in Kyrgyzstan.\n\nNational Crime Agency One of the cash seizures made by the NCA\n\nRossi bought the bank through his company Altair Holding SA. On Christmas Day 2024, Altair Holding SA took a 75% stake in Keremet Bank. Further work showed that Keremet Bank was facilitating payments for a Russian state-owned bank called Promsvyazbank (PSB) which is described by the US treasury as a \"sanctions evasion hub\". The NCA says Keremet Bank was helping PSB make payments for \"Russia's military-industrial base\", in other words, for the arms factories making weapons for the Ukraine war. At street level TGR and Smart provide a \"full spectrum of money-laundering services\", the NCA said. They allow people like drug dealers and suppliers of illegal firearms to swap their cash for cryptocurrency. Investigators say the money-laundering network was operating in at least 28 towns and cities across the UK \"sustaining an entire architecture that allows crime to pay in our country\".\n\nThe NCA's Sal Melki said: \"We can't ignore the sheer scale of this threat.\" He said: \"We can draw a thread between somebody buying cocaine on a Friday night in the UK, all the way through to geopolitical events that are causing suffering across the world. \"It's not as simple as 'OK, I pay my drug dealer and that is the end of it'. This is actually a vast criminal ecosystem, that is funding some really bad things all around the world. \"We can say with certainty that laundering street cash is really critical to underpinning how serious crime works in our country.\"\n\nNational Crime Agency Ekaterina Zhdanova ran the Smart money-laundering network\n\nHe also said that his investigators had discovered that the Smart network run by Ekaterina Zhdanova had provided financial services to the ring of spies led by Bulgarian Orlin Roussev, who tracked Russia's enemies across Europe. Zhdanova is currently in custody in France awaiting trial. Operation Destabilise began by tracking the activity of the ransomware group Evil Corp, but ended up uncovering \"eye-watering scales\" of money-laundering, the NCA said. Smart and TGR were trading \"billions of pounds of criminal wealth\". The money they collected was laundered through cash-rich businesses such as construction, or bundled up in \"stash houses\" and taken out of the country to be laundered overseas. Sometimes the cash was smuggled out hidden in boxes of washing powder and baby formula.\n\nNational Crime Agency Boxes of washing powder used to smuggle cash out of the UK\n\nAmong those linked to the groups are former Hibernian footballer James Keatings, and Semen Kuksov and Andrii Dzektsa, who the NCA say laundered money for the Irish Kinahan drugs cartel. Two men convicted this year, Valeriy Popovych and Vitaliy Lutsak, were buying vehicles in the UK and driving them to Ukraine where they sold the vehicles for cryptocurrency. One spreadsheet suggested they had laundered £6.63m of dirty British cash just between August 2022 and June 2023.\n\n'Walls closing in'\n\nAt the bottom rung of the ladders, the money-launderers need couriers to move criminal cash around the country. The couriers typically earn a commission of 0.5%. So moving £100,000 earns them £500. But they can get prison sentences of five years or more. \"You own all the risk,\" Mr Melki warned them.\n\nNational Crime Agency\n\nAdverts have been placed above urinals in motorway service stations in Russian and English warning that \"moving money for organised criminals might seem like easy work. But it ends with hard time\". The NCA's Mr Melki said: \"We're communicating with them directly in their own language to say: the walls are closing in. \"We know who you are, and we're coming for you.\""
    },
    "https://www.bbc.com/news/articles/c8dyqzm0rp4o": {
        "source": "BBC News",
        "topic": "crime",
        "title": "West Bank: Israeli troops kill two Palestinians after they appear to surrender",
        "content": "Israeli troops kill two Palestinians after they appear to surrender\n\nWatch: BBC correspondent examines footage showing moments leading up to shooting in the occupied West Bank\n\nThe Israeli military and police say the men were wanted men \"affiliated with a terror network\" and the incident is under review.\n\nThe Palestinian Authority (PA) accused Israeli forces of committing a \"war crime\" and described the killings as \"brutal\" field executions.\n\nThe incident happened during an ongoing Israeli military operation in the city of Jenin.\n\nVideo has emerged showing Israeli security forces shooting dead two Palestinians who appeared to have surrendered in the occupied West Bank.\n\nIsrael's far-right national security minister Itamar Ben Gvir has given his full backing to the officers involved, adding that \"terrorists must die\".\n\nThe video shows two Palestinian men come out of a building with their hands up. They are surrounded by a number of Israeli border guards. They then kneel on the ground. One of them lifts his t-shirt, apparently to show that he is not armed.\n\nAfter a short period, they move back into the building. Border police then open fire, killing them.\n\nA joint statement from the IDF and police said forces had been trying to apprehend wanted individuals who had carried out \"terror activities\", including throwing explosives and firing at security forces.\n\n\"The forces entered the area, enclosed the structure in which the suspects were located, and initiated a surrender procedure that lasted several hours,\" the statement said.\n\n\"Following the use of engineering tools on the structure, the two suspects exited. Following their exit, fire was directed toward the suspects.\"\n\nWriting on X, Ben-Gvir said \"the fighters acted exactly as expected of them\".\n\nThe raid in Jenin is the latest in a months-long Israeli campaign in cities in the northern West Bank, which Israel says is necessary to tackle Palestinian armed groups it says were responsible for attacks on Israeli soldiers and Jewish settlers. On Wednesday the Israeli military launched an operation in the nearby city of Tubas.\n\nViolence in the West Bank has spiked since the Hamas attack on southern Israel in October 2023, which led to a devastating Israeli military campaign in Gaza.\n\nIsraeli troops or settlers have killed more than 1,000 Palestinians, including members of armed groups and civilians, in the West Bank since then, the UN says. At least 44 Israelis, including soldiers and civilians, have been killed in Palestinian attacks or during Israeli military operations, Israel says."
    },
    "https://www.bbc.com/news/articles/cdd541624j1o": {
        "source": "BBC News",
        "topic": "terrorism",
        "title": "UK to hold new national day to remember terror victims",
        "content": "UK to hold new national day to remember terror victims\n\n24 November 2025 Share Save Ewan Somerville Share Save\n\nAFP via Getty Images Tributes to the victims of the Manchester arena attacks filled the city centre in 2017\n\nThe government has announced a new national day \"to honour and remember\" victims and survivors of terrorism in the UK. The event will take place on 21 August in a different location across the country each year, with the first held in 2026, the Home Office has said. It comes after a campaign by families and survivors, including those affected by the Westminster Bridge and Manchester arena attacks. Security Minister Dan Jarvis said: \"We will stand together as a nation - honouring all those impacted by terrorism and the horrific experiences they have endured.\"\n\nFew details have been released about the first event next summer, but the government said it would keep working with victims and survivors to discuss the day's exact name and design a symbol. The Home Office said the day would focus on \"remembering and recognising those impacted by terrorism, encouraging victims and survivors to access specialist support, educating the public, and amplifying victims' and survivors' stories\". The chosen date coincides with the UN International Day of Remembrance and Tribute to the Victims of Terrorism, which began in 2017. Travis Frain, survivor of the Westminster Bridge attack, said he had \"fought tirelessly\" for the UK to adopt a national day of this kind to help \"educate the next generation\". He added that it was \"important that as a society we commemorate and remember those affected - for the impacts are often lifelong\".\n\nGetty Images The parents of Martyn Hett met PM Sir Keir Starmer earlier this year, having campaigned for Martyn's Law to help prevent attacks in large venues\n\nFigen and Stuart Murray, the parents of Martyn Hett who was killed in the Manchester arena attack in 2017, said the day would not only honour the lives lost, but also acknowledge the \"immense courage of survivors\". The 2017 Westminster Bridge attack, in which four people died when a man drove his car into crowds and then stabbed a police officer outside Parliament, and the bombing at an Ariana Grande concert in Manchester the same year, in which 22 people died and 116 were injured, are among the worst attacks in the UK in recent years. In October, two people were killed in an attack that the government said was \"an evil act of antisemitic terrorism\" on a synagogue in Manchester on the holy Jewish day of Yom Kippur. Ministers have previously been criticised over support provided to victims and survivors of terror attacks. In 2023, support network Survivors Against Terror published a report surveying more than 130 survivors of 11 attacks, which described the official compensation scheme for such incidents - the Criminal Injuries Compensation Authority (CICA) - as \"broken\". At the time, the government said the scheme had paid £158m to victims of violent crime in the previous year alone. A subsequent review by the Home Office's Victims of Terrorism Unit found support for victims and survivors of terror attacks \"needs to go further\". In response to that, the consultation for the national day was launched, along with plans for a support hub with specialist trauma care that the government says it expects to start next summer."
    },
    "https://www.bbc.com/news/articles/cm20ldz0g9ro": {
        "source": "BBC News",
        "topic": "terrorism",
        "title": "Sally Rooney books may be withdrawn from UK sale over Palestine Action ban, court told",
        "content": "Sally Rooney books may be withdrawn from UK sale over Palestine Action ban, court told\n\n27 November 2025 Share Save Dominic Casciani Home and Legal correspondent Share Save\n\nGetty Images\n\nIrish author Sally Rooney has told the High Court it was \"almost certain\" she cannot publish new novels in the UK and may have to withdraw her current books because of the banning of Palestine Action under terrorism laws. Rooney says UK legislation may mean she cannot be paid royalties by her British publisher or the BBC because it could leave both at risk of being accused of funding terrorism. In August, she said she intended to use royalties \"to go on supporting Palestine Action\". The group was banned in July after the home secretary accused it of causing serious damage to property. Its co-founder is challenging that ban in the High Court, arguing it interferes with the right to protest.\n\nThe author of Normal People, which was adapted into one of the most watched BBC dramas of recent years, has supported the campaign to reverse the ban. In two witness statements provided to the High Court, Rooney said she believed that Israel had committed genocide in Gaza - and Palestine Action's activity in the UK was from a \"long and proud tradition of civil disobedience - the deliberate breaking of laws as an act of protest\". She went on: \"I myself have publicly advocated the use of direct action, including property sabotage, in the cause of climate justice. It stands to reason that I should support the same range of tactics in the effort to prevent genocide.\" Israel has regularly denied that its actions in Gaza amount to genocide and says they are justified as a means of self-defence. Rooney said the ban on Palestine Action under terrorism laws also had far reaching consequences for her as an author and her right to free expression. She explained she periodically receives royalties from the BBC's adaptions. In August she declared in an Irish Times article that she intended to use those royalties \"to go on supporting Palestine Action\". Following that statement, she said she had been advised that any such payment to her for those televised dramatisations could be a breach of terrorism laws. That warning had come from the independent producer of the two BBC dramatisations of her novels. It told her agent that it had received \"unambiguous legal advice\" that if it knew or suspected that Rooney was using royalties from the TV dramas to fund Palestine Action, sending her the money would be a terrorism offence. \"It is therefore unclear whether any UK company can continue to make payments to me, even when it had agreed to do so,\" said Rooney.\n\nDemonstrators gathered outside the High Court during the opening of the case"
    },
    "https://www.bbc.com/news/articles/cn98jnr5jpzo": {
        "source": "BBC News",
        "topic": "terrorism",
        "title": "Man charged with terror offences after Manchester synagogue attack",
        "content": "Terror charges for man known to synagogue attacker\n\n4 December 2025 Share Save Ewan Gawne North West Share Save\n\nReuters Mohammad Asim Bashir, 31, was not directly involved in the October attack but is alleged to have been an associate of Jihad Al-Shamie\n\nA man has been charged with terror offences after allegations he drove the Manchester synagogue attacker to survey a UK defence facility. Mohammad Asim Bashir, 31, who lives in Cheetham Hill, North Manchester, has been charged with one count of preparation for acts of terrorism and three counts of dissemination of terrorism publications. Jihad Al-Shamie was shot dead by police in his attack at Heaton Park Hebrew Congregation synagogue on Yom Kippur - the holiest day in the Jewish calendar. Mr Bashir, who Greater Manchester Police said was British Pakistani, was known to Al-Shamie but was not directly involved in the attack on 2 October.\n\nIt is alleged that Mr Bashir took Al-Shamie to an unnamed defence facility on 14 August to carry out hostile reconnaissance. He is also set be prosecuted for allegedly sharing material over WhatsApp with intent to encourage acts of terrorism. Police arrested Mr Bashir at Manchester Airport on 27 November. He was detained initially on suspicion of commission, preparation and instigation of acts of terrorism over the synagogue attack but he was released without being charged in relation to this. Mr Bashir was earlier charged with terrorism offences that are not directly related to the attack. Frank Ferguson, of the Crown Prosecution Service, said there was sufficient evidence to charge Mr Bashir with one offence of preparation of terrorist acts and three offences of sharing terrorist publications with Al-Shamie and others with the intent to encourage acts of terrorism.\n\nFacebook Police say Mr Bashir took Al-Shamie, pictured, to an unnamed military base\n\nAssistant Chief Constable Rob Potts, who holds operational responsibility for Counter Terrorism Policing North West, said the charges were not directly related to the synagogue attack \"but come as a result of enquiries conducted by our investigation team\". Chief Constable Potts said the investigation into the attack \"remains live\" and urged anyone with information to come forward. Mr Bashir is set to appear at Westminster Magistrates' Court on Friday.\n\nListen to the best of BBC Radio Manchester on Sounds and follow BBC Manchester on Facebook, X, and Instagram. You can also send story ideas via Whatsapp to 0808 100 2230."
    },
    "https://www.bbc.com/news/articles/c87ld73xyx0o": {
        "source": "BBC News",
        "topic": "terrorism",
        "title": "Dozens arrested at pro-Palestine protests across England",
        "content": "Dozens arrested at pro-Palestine demonstrations\n\n29 November 2025 Share Save Share Save\n\nBBC Avon and Somerset Police made 31 arrests in Bristol city centre\n\nDozens of protesters have been arrested under the Terrorism Act at a series of pro-Palestine demonstrations held across England. Campaign group Defend Our Juries organised demonstrations in 10 locations on Saturday, including Bristol, Manchester and Birmingham. The organisers said they were protesting \"against our Government's complicity in genocide and against the ban on [direct action group] Palestine Action\". Palestine Action was proscribed under the Terrorism Act 2000 in July. In Bristol city centre, 31 people were arrested, while in Manchester, 34 were held at a rally attended by 200.\n\nIn Birmingham, 25 protesters carrying placards expressing support for Palestine Action were arrested at a rally in Chamberlain Square in the city centre, West Midlands Police said. Ch Insp James Littlehales said: \"We fully recognise people's right to demonstrate peacefully, and many people continue to protest in support of Palestine without breaking the law. \"But we will take appropriate action where people are breaching the law by showing support for proscribed organisations.\" Greater Manchester Police said it had detained 34 protesters in St Peter's Square for suspected terror offences.\n\nPA Thousands of demonstrators marched in London at a separate rally organised by Palestine Coalition\n\nIn Bristol, demonstrators congregated at College Green and 30 people were arrested on suspicion of displaying articles in support of a proscribed organisation. One woman was held on suspicion of failing to provide details under the Police Reform Act, Avon and Somerset Police said. Insp Ben Spence said: \"The protest has now safely concluded and the police operation has been stood down.\" Officers also arrested 10 protesters in Norwich. Norfolk Police said a group of people were being held under the Terrorism Act on suspicion of holding placards that showed support for Palestine Action.\n\nA separate protest in London organised by the Palestine Coalition attracted about 100,000 demonstrators, the group said. Five arrests were made for suspected affray and Public Order Act offences, according to the Met Police. Many of those gathered in the capital carried Palestinian flags and chanted pro-Palestinian and anti-Israel slogans as they walked from Green Park to Whitehall. Some set off green and red fireworks as they walked down Piccadilly in central London."
    },
    "https://www.bbc.com/news/articles/cy072n5w4wdo": {
        "source": "BBC News",
        "topic": "terrorism",
        "title": "Covid denier jailed for three years after urging armed revolt",
        "content": "Covid denier jailed for three years after urging armed revolt\n\nMartin hoarded weapons in his flat in South Norwood, including crossbows and pistols, although he was cleared of collecting them for the purposes of terrorism. He was found guilty of encouraging terrorism.\n\nThe Old Bailey heard 60-year-old Paul Martin was a prolific poster in a Telegram group called The Resistance UK, and called on people to attack the UK's infrastructure.\n\nA Covid denier from south London has been sentenced to three years and three months in prison after urging people to stage an armed revolt during the pandemic.\n\nHe maintained during his trial that his two crossbows were \"purely for sport\" and that two pistols were the kind \"commonly used in fairgrounds\".\n\nProsecutor Julia Faure-Walker told the court that his messages were designed to \"stir up the idea of violent revolt using weapons for his ideological cause\".\n\nThe 10-member jury was shown messages he had posted on the Telegram online chat group.\n\nIn December 2020 he wrote: \"It is a war, you better get ready to smash skulls and destroy evil.\"\n\nMartin also called for attacks on 5G and CCTV, saying that if groups attacked the UK's infrastructure, then the authorities would \"be running around like flies\".\n\n\"If we do lawful reb (rebellion), we need lots of us.\"\n\n\"And plenty Alpha men and women... it will be a war, and the police will do everything to stop us.\"\n\nLater he told the 8,000 strong group, to which he posted thousands of messages: \"You do know if it kicks off lives will be lost on both sides. That's the reality.\"\n\nIn one post, Martin wrote: \"The simple fact is there is no pandemic, never has been. The main goal was to genocide all they can and enslave the survivors and make the children sterile with poison.\"\n\n\"Vaccine is a poison designed to kill you off over a short period.\"\n\nWhile giving evidence, he was questioned about his beliefs during the pandemic. He claimed he had feared that people would be forced to have the Covid vaccine.\n\n\"I thought we would lose our privilege of consent, that we'd be forced to have it,\" he told defence counsel Dominic Thomas.\n\n\"That gave me scary thoughts.\n\n\"What I see on the news, drag them out of the houses, jab them, all this.\"\n\nMartin suggested that he had \"fallen down a rabbit hole\" during the pandemic and denied he had ever intended to commit any violent acts himself.\n\nHe told the court he was \"just talking twaddle\" and was writing things down as he thought them.\n\nMartin pleaded guilty to a charge of possessing a stun gun at the beginning of his trial but had denied the terrorism charges.\n\nMr Thomas told the sentencing hearing that his client was eccentric and claimed there was a \"schoolboy quality\" to his interests.\n\n\"Martin had got a job and won the respect of both his manager and customers,\" he said.\n\n\"He is trying to let go of those previous obsessions. He is keeping stable hours, not drinking, he has taken himself off the internet entirely.\"\n\nBut in the sentencing, Judge Richard Marks KC said the case involved \"recklessness on a very high scale and language of a virulent nature\".\n\n\"They [the messages] were posted to people who might have been very impressionable and not unsympathetic to the extreme views you were posting,\" he said.\n\nCdr Dom Murphy, head of Counter Terrorism Policing London, said \"anyone who advocates violence in this way can expect to be arrested and prosecuted to the full extent of the law\"."
    },
    "https://www.npr.org/2025/12/04/nx-s1-5630490/prison-doj-safety-memo-changes-trans-lgbtq-inmates": {
        "source": "NPR",
        "topic": "LGBTQ",
        "title": "DOJ orders prison inspectors to stop considering LGBTQ safety standards",
        "content": "DOJ orders prison inspectors to stop considering LGBTQ safety standards\n\ntoggle caption Andrew Harnik/AP\n\nThe Department of Justice has instructed inspectors to stop evaluating prisons and jails using standards designed to protect transgender, intersex and gender-nonconforming people from sexual violence, according to an internal memo obtained by NPR.\n\nThis population is uniquely vulnerable to attacks while incarcerated, data shows, and advocates say the change will put such people in even more danger.\n\nThe memo explains that DOJ is in the process of revising federal standards related to the 2003 Prison Rape Elimination Act (PREA) in order to align with President Trump's executive order on \"gender ideology extremism.\" The Jan. 20 executive order asserts that the United States recognizes only two sexes: male and female.\n\nSponsor Message\n\nAccording to the DOJ memo, while the revision process is underway, detention centers that undergo PREA audits will no longer be inspected using standards specifically designed to keep LGBTQ and intersex people safe. The facilities include federal prisons, state prisons and jails, juvenile detention centers and immigration detention centers. These inspectors, referred to as auditors, are not employed by the DOJ, but are hired by corrections agencies or by individual facilities. The DOJ certifies the auditors and can decertify them.\n\nThe DOJ did not respond to NPR's request for comment on the memo. But this is the latest policy move by the Trump administration that removes legal protections for trans people — particularly those who are incarcerated. In his first few days in office, Trump upended long-standing federal policies that would allow incarcerated trans women to be housed in a facility that aligns with their gender identity. Trump has also signed an executive order banning transgender troops from serving openly in the military and another restricting gender-affirming care for minors. These orders have faced a host of legal challenges and are still being fought in court.\n\nPREA mandates regular audits for prisons and jails. Those audits are among the few oversight tools for evaluating whether detention centers follow laws meant to stop rape, harassment and retaliation.\n\nSponsor Message\n\nAuditors visit facilities regularly to ensure the staff and officials are doing everything they are supposed to under PREA to prevent sexual abuse and harassment. They interview staff and inmates, tour the facilities and check existing procedures.\n\nLinda McFarlane, executive director of Just Detention International, said this rollback \"will immediately put people in danger.\" JDI is a human rights group dedicated to ending sexual abuse in detention. McFarlane also was involved in advocating for the passage of PREA in 2003.\n\n\"It's going to make people less safe,\" she said. \"And when facilities are less safe for the most vulnerable and marginalized, they're less safe for everybody.\"\n\nIn practice, the memo says auditors will no longer review whether facilities house transgender people based on their gender identity and on a case-by-case basis. Among other changes, the memo also says auditors should no longer consider whether sexual assaults were motivated by gender-identity bias.\n\nA major 2015 survey from the criminal justice group Black and Pink found that LGBTQ prisoners were over six times as likely to be sexually assaulted as the general prison population. This is based on survey responses from more than 1,110 inmates. According to Brenda Smith, a professor at American University Washington College of Law and director of The Project on Addressing Prison Rape, the available data doesn't show the whole picture and that rate could be higher.\n\n(In 2003, Smith was appointed to the National Prison Rape Elimination Commission, which helped develop these very standards.)\n\nShe said the current changes laid out in the memo ignore this grim reality.\n\nIn the spring, the DOJ made massive funding cuts to crime-victim advocacy programs across the nation, including the National PREA Resource Center — the organization that trains auditors, tracks the outcomes of investigations and provides resources to victims and auditors. More than 360 grants were cut in April, but funding was reinstated for many of them following media reports of the cuts.\n\nThe DOJ at the time told NPR that it was \"focused on prosecuting criminals, getting illegal drugs off of the streets, and protecting American institutions from toxic DEI and sanctuary city policies. Discretionary funds that are no longer aligned with the administration's priorities are subject to review and reallocation.\"\n\nThe standards designed to protect inmates from sexual violence were developed after years of bipartisan work. They were created in response to overwhelming data, anecdotal evidence and a landmark Human Rights Watch report that showed sexual violence was, and continues to be, a serious problem behind bars.\n\nSponsor Message\n\nThe most recent data from the Bureau of Justice Statistics shows that in 2020, correctional administrators reported 36,264 allegations of sexual victimization in prisons, jails and other adult correctional facilities. The allegations included incidents of sexual violence, harassment and misconduct carried out by inmates against other inmates and by staff members against inmates. The report said 2,351 of those allegations — a rate of 1.2 incidents per 1,000 inmates — were substantiated after investigation.\n\nLingering confusion\n\nMcFarlane's group, Just Detention International, says the DOJ memo lays out the government's plan to permanently revise the PREA standards and marks the first time the administration has publicly indicated what requirements it aims to remove.\n\nBut until the revisions are finalized through the ongoing rulemaking process, the memo instructs auditors to mark those standards as \"not applicable\" during audits — even though the rules technically remain in effect, according to the memo.\n\nIn a statement, the National Association of PREA Coordinators, a professional organization for coordinators who ensure agencies' compliance with the law, said that since the DOJ has not finalized any new regulations related to PREA, the current standards remain unchanged.\n\nIn the absence of a separate state or municipal law, the statement said, the DOJ memo allows each corrections agency or detention facility \"to continue following the regulation or, if they choose, to ignore it.\"\n\nThe memo allows the DOJ \"to implement the President's policy while allowing state and local governments to determine how to best meet the needs of incarcerated people who are transgender and gender diverse,\" according to the statement.\n\n\"Whether a system adopts a binary sex approach or one that recognizes a spectrum of gender, we cannot forsake our primary responsibility to keep the most vulnerable individuals in our care safe from those who present a threat of sexual abuse or sexual harassment,\" the statement said.\n\nSponsor Message\n\nIt's unclear how the DOJ plans to enforce the memo, and it's already sparked some confusion for at least one auditor.\n\nKenneth L. James, a PREA auditor for detention centers in multiple states, told NPR in an email that the memo makes the auditors' jobs \"both more confusing and more difficult.\"\n\nHe said it will affect how the auditors are trained. \"Some auditors have been auditing for over 10 years and conduct audits systematically,\" James said. \"By removing these elements, auditors will have to reevaluate how they are auditing and may miscalculate compliance due to these unexpected changes.\"\n\nBut because PREA has been in place for more than 20 years and the prevalence of sexual abuse within the prison system is well-known, James said, \"I believe and trust\" that facilities \"will do what is best for the incarcerated population.\""
    },
    "https://www.yahoo.com/news/articles/joe-biden-slams-republicans-turning-152343574.html": {
        "source": "Yahoo Entertainment",
        "topic": "LGBTQ",
        "title": "Joe Biden slams Republicans for turning transgender rights into ‘political football’",
        "content": "Joe Biden has criticized Republicans for turning transgender rights into a “political football” in a speech that the former US president delivered at an LGBTQ+ event.\n\nSpeaking at the International LGBTQ+ Leaders Conference in Washington on Friday, Biden urged LGBTQ+ people to “get up and fight back” against Donald Trump’s second presidential administration.\n\n“Folks, Donald Trump and his Republicans are trying to derail and distort our fight for equality,” Biden said, as the Democrat accepted a lifetime achievement award for his contributions to the community. “They’re trying to turn it into something scary, something sinister.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“There is nothing more American than the notion of equality. Nothing, nothing, nothing.”\n\nBiden, who as president signed the Respect for Marriage Act, which requires states to recognize same-sex marriages from other states, said Republicans had “weaponized people’s basic identity and turned it into a political football”.\n\nRelated: DoJ moves to eliminate sexual abuse protections for LGBTQ+ people in prisons\n\n“They’re trying to turn it into something scary, something sinister,” Biden said. “But folks, it’s not really about anything that’s all that complicated. At its core, it’s about giving every American an opportunity to be treated with the basic decency, dignity and respect they all deserve.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBiden’s support for same-sex marriage came relatively late in life. In the 1990s, while in the Senate, Biden voted in favor of the Defense of Marriage Act. But in 2012, as vice-president, he famously expressed support for same-sex unions before Barack Obama, then the president, had done so.\n\n“I got myself in a bit of trouble – good trouble,” Biden said on Friday.\n\nIn his speech, Biden said: “There are young people sitting alone as I speak, scrolling through social media, wondering whether they will ever truly be accepted for who they are.\n\n“You are heard, and you belong,” he added.\n\nThe speech marked a rare public appearance for Biden, who announced he was diagnosed with prostate cancer in May.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBiden’s lone term in the White House interrupted Trump’s two presidencies. Concerns over Biden’s physical health and mental acuity were key to him dropping out of his campaign for a second term in 2024.\n\nBiden, 83, opened himself up to renewed commentary about some of those issues when he mispronounced “America” during his speech on Friday.\n\n“As long as we keep the faith, some hope and get back up and remember who in the hell we are – we are the United States of Amerigotit,” Biden said.\n\nHe then added: “That’s who we are. We are the US.”"
    },
    "https://www.yahoo.com/news/articles/man-pleads-guilty-killing-ole-193859349.html": {
        "source": "Yahoo Entertainment",
        "topic": "LGBTQ",
        "title": "Man pleads guilty to killing an Ole Miss graduate who was prominent in the LGBTQ+ community",
        "content": "JACKSON, Miss. (AP) — A man charged with killing a University of Mississippi graduate who was prominent in the LGBTQ+ community pleaded guilty on Monday to second-degree murder and tampering charges as he faced a second trial.\n\nSheldon “Timothy” Herrington Jr. entered the plea in the death of Jimmie “Jay” Lee, who disappeared from Oxford, where the university is located, in July 2022. Herrington was arrested two weeks later and eventually charged with capital murder.\n\nA judge declared a mistrial last year when jurors failed to reach a verdict after more than nine and a half hours of deliberation. At the time of the trial, Lee's body had not been found, but a judge had declared him dead.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn February of this year, deer hunters stumbled upon Lee’s skeletal remains in a wooded area, according to Mississippi Today.\n\nDuring the first trial, prosecutors claimed Herrington, who was not openly gay, killed Lee after the two had a sexual encounter.\n\nCampus cameras showed Lee leaving his apartment shortly before 4 a.m. the day he disappeared. He returned 40 minutes later, before leaving again just before 6 a.m.\n\nProsecutors allege Lee had been at Herrington’s apartment, and that when Lee had left Herrington’s apartment he was upset. Herrington, they said, invited Lee back and searched “how long does it take to strangle someone\" online before Lee arrived.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe final text message from Lee’s phone was sent to a social media account belonging to Herrington at 6:03 a.m. from a spot near Herrington’s apartment, law enforcement testified. Accounts belonging to Herrington and Lee had previously exchanged sexually explicit messages, they said.\n\nHerrington was later captured by surveillance video jogging out of a parking lot where Lee’s car was found. He was also seen picking up a shovel and wheelbarrow at his parents’ house, authorities said.\n\nHerrington is from Grenada, Mississippi, about 52 miles (83.7 kilometers) southwest of Oxford. Lee's body was found in neighboring Carroll County.\n\nBoth Herrington and Lee had graduated from the University of Mississippi.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nLee had been pursuing a master's degree. He was known for his creative expression through fashion and makeup and often performed in drag shows in Oxford, according to a support group called Justice for Jay Lee.\n\nHerrington is set to be sentenced on Tuesday.\n\nHis lawyers were not immediately available for comment."
    },
    "https://www.jezebel.com/feminism-lives-to-see-another-day": {
        "source": "Jezebel",
        "topic": "feminism",
        "title": "Feminism Lives to See Another Day",
        "content": "It’s hard to believe that in the chaotic year of our lord 2025, Sabrina Carpenter’s album cover for Man’s Best Friend managed to dominate multiple news cycles. Many were worried that the image of Carpenter on all fours, staring straight into the camera, with a man pulling on her hair from above, officially destroyed feminism; many saw it as a cheeky wink; many didn’t care; many were more upset over the album’s second track, “Tears,” in which she sings about getting wet because her lover did the dishes; too many recorded a TikTok video of their take.\n\nCarpenter did respond to the backlash on a couple of occasions, but in a new Variety cover story, Carpenter has responded to the backlash once and for all. “It meant one thing to me and 100 things to other people, and I was looking at it going, ‘That’s valid. Mine’s valid. What’s for dinner?’” Honestly? No notes. She continued: “Not to bypass the weight that it did carry for some people. I saw it and was like, ‘That is a great point. It wasn’t the point I was trying to make.’”"
    },
    "https://www.newyorker.com/magazine/2025/12/15/letters-from-the-december-15-2025-issue": {
        "source": "The New Yorker",
        "topic": "feminism",
        "title": "Letters from Our Readers",
        "content": "Foundations\n\nAdam Gopnik is right that Trump’s demolition of Roosevelt’s East Wing violates the democratic process (Comment, November 3rd). But the White House building itself is not exactly a paragon of democracy. Gopnik’s piece sent me back to John Ruskin, whom he cites as “the greatest of architectural critics.” In “The Stones of Venice,” Ruskin insists that buildings record not just the ideals of those who commissioned them but also the conditions of those who built them. The East Wing was grafted onto an original structure that was built in part by enslaved people. Its neoclassical form proclaimed republican ideals; its production betrayed them. Trump’s wrecking ball is crude, but the gap between democratic symbolism and democratic practice is not new.\n\nDylan Mulvaney\n\nBrooklyn, N.Y.\n\nBetter Men\n\nAs a feminist, a therapist, and a mother of twin teen-age boys, I was eager—but ultimately disappointed—to read Jessica Winter’s piece on the so-called crisis facing men (The Weekend Essay, November 9th). Her essay elided something crucial: if feminism does not expand its concern to include the well-being of men, it risks further deepening the backlash against women’s gains which is already roiling our politics.\n\nPatriarchal masculinity isolates men emotionally and leaves them relationally insecure. The very tools that they need to mature—emotional literacy, empathy, connection—are forfeited in exchange for a ticket to “manhood.” Without these tools, boys and men turn their pain outward, kicking the proverbial dog. We see what that looks like in the news every day.\n\nWe need a healthier and more secure model of masculinity. Today’s feminism seems to want this model to be genderless. (For example, Winter describes a male ideal evoked in the book she reviews as “blessedly gender-free.”) We should not proudly celebrate women’s empowerment at the same time that we advocate for boys and men to disavow masculinity; feminism cannot depend on the erasure of male identity. If we don’t help to articulate new, healthier visions of masculinity, then reactionary movements will do it for us. They already are.\n\nKarin Swann-Rubenstein\n\nSanta Rosa, Calif.\n\nA Language Lesson\n\nI was delighted by Jill Lepore’s article about attempts to find historical precedents for Donald Trump and for the “furor, disarray, and murderous violence” of our political era (“American Frequencies,” November 3rd). I especially appreciated that Lepore described Trump as “the world’s most outspoken troll.” Nowadays, commentators frequently introduce Trump by describing him as a “felon” or a “convicted criminal.”\n\nIn the United States, there are about twenty-four million people who have been convicted of felony offenses. Not all of their convictions were the result of fair processes. As criminal-justice advocates point out, all too often our system extracts guilty pleas from people who may stand a chance of success at trial but are intimidated by the prospect of mandatory minimum sentences. (There are also other reasons that we may not believe a conviction to be fair, such as the use by police of methods that should qualify as entrapment.) Words like “felon” and “convict” are often used, as in reference to Trump, to signal that someone has inherently low moral worth. This can contribute to the punishing of people who have already been subject to injustices, and to a stigma that falls especially heavily on those who lack Trump’s money and power.\n\nGeorge Z. Banks\n\nSan Leandro, Calif.\n\n•\n\nLetters should be sent with the writer’s name, address, and daytime phone number via e-mail to themail@newyorker.com. Letters may be edited for length and clarity, and may be published in any medium. We regret that owing to the volume of correspondence we cannot reply to every letter."
    },
    "https://www.theatlantic.com/ideas/2025/12/heritage-foundation-women-voting/685112/": {
        "source": "The Atlantic",
        "topic": "feminism",
        "title": "Does Heritage Support Discrimination Against Women?",
        "content": "The Heritage Foundation has had a tough month. President Kevin Roberts’s decision to vigorously defend Tucker Carlson’s platforming of the noted anti-Semite and white nationalist Nick Fuentes has pushed the conservative think tank into a tailspin. One board member, the Princeton professor Robert George, resigned; a number of staff departed; and a task force to combat anti-Semitism severed its ties.\n\nYet Heritage’s problems are hardly limited to its handling of Fuentes. The think tank’s recent decision to hire Scott Yenor, a family-policy scholar, to lead the Foundation’s B. Kenneth Simon Center for American Studies poses serious questions about the institution’s beliefs concerning the equality of women in the workplace and perhaps even as citizens.\n\nYenor’s views are, to say the least, controversial. In a 2021 speech at the National Conservatism Conference, he labeled professional women “medicated, meddlesome, and quarrelsome.” He has echoed the online right’s use of the term AWFLs (for “affluent white female liberals”) in his writing, and had to step down from an appointment as the chair of the University of West Florida’s board of trustees when it became clear that the Republican-controlled state Senate would not confirm him.\n\nYenor has also criticized prominent figures on the right, such as Megyn Kelly, the former Fox personality who now hosts a popular podcast. She argued that it was wrong for conservative men, when looking for a spouse, to prefer women who don’t work full-time. Yenor responded that that’s precisely what conservative men should do, contending that “the heroic feminine prioritizes motherhood and wifeliness and celebrates the men who make it possible.”\n\nJonathan Chait: The conservative movement’s intellectual collapse\n\nHis rhetorical pugnacity, though, is merely a symptom of the challenge that he presents to the beleaguered Heritage Foundation. It’s his ideas, not just his words, that are the problem.\n\nYenor believes that employers should be legally permitted to discriminate against women in the workplace, and has advocated for legal changes that would allow businesses “to support traditional family life by hiring only male heads of households, or by paying a family wage”—that is, denying women jobs solely on the basis of their sex or paying men more for performing the same job as women. He also believes that “governments should be allowed to prepare men for leadership and responsible provision, while preparing women for domestic management and family care.”\n\nThose ideas put him at odds with today’s Republican Party. The GOP has spotlighted high-ranking women—including White House Chief of Staff Susie Wiles, Press Secretary Karoline Leavitt, Representative Elise Stefanik of New York, Arkansas Governor Sarah Huckabee Sanders, and Senator Katie Boyd Britt of Alabama—in its bid to attract more female voters. One doubts it would welcome the idea that powerful men should be allowed to punish or prevent their rise solely because they are women.\n\nEven Heritage’s leadership might balk at that concept. Its board of trustees has four female members, including its chair. Does Yenor believe that their parents should have guarded their daughters from taking higher education too seriously? “The Mrs. Degree,” he’s written, “with additional credentialing for work, is all you want by graduation day.”\n\nMany social conservatives will disagree. Take Kris Ullman, who is both a mother of three and the president of the Eagle Forum, a powerful social-conservative lobbying group. It rose to prominence in the 1970s under the leadership of Phyllis Schlafly, who herself combined motherhood with a career to defeat ratification of the Equal Rights Amendment nearly single-handedly.\n\nUllman believes that motherhood has been devalued in the culture and that full-time paid child care should be resisted because “the emotional security and love provided by the mother is second to none, especially from birth to age 3.” But she parts ways with Yenor on the question of discrimination, giving a simple answer when I asked whether she agreed that employers should discriminate against women in the workplace: “No.”\n\nYenor’s ideas on employment discrimination are decisively outside the American and conservative mainstreams. But his most extreme views on gender are so radical that he tends to articulate them only elliptically.\n\nMarriage, Yenor argues, should be the formation of a natural community that can “reconcile what men and what women want.” In his view, the two sexes are formed by nature to be fully complementary. Women bear children, are more tender and attached to their offspring, and prefer to focus on the home. Men father children, are more attached to achievement and competition, and prefer to focus on matters outside the home. Traditional marriage brings these two worldviews together by making men responsible for supporting and protecting women as they achieve their goals, and by making women the primary support for men as they achieve theirs.\n\nThis, in Yenor’s view, resulted in the English common-law concept of “coverture marriage,” the prevailing form of marriage at the time of America’s founding. Under the legal doctrine of coverture, the man “covered” the woman by taking all responsibility—and holding all power—in public life. The husband voted, was solely eligible to practice professions and hold public office, and held title to all the family’s property. Divorce was either illegal or restricted to extreme circumstances, such as abandonment and adultery. In return, the husband provided for and protected his wife and children to the best of his ability.\n\nThis arrangement understandably rankled many, Yenor argues, leading to the first wave of feminism. In that movement, typified by the Seneca Falls Convention of 1848, suffragettes campaigned to end this repressive system. They succeeded, drawing on the ideals of the Declaration of Independence. Yenor notes that the goal of these activists was to create an “independent woman” who could stand apart legally from her husband, and he contends that the passage of the Nineteenth Amendment, giving women the vote nationwide, was their crowning achievement.\n\nThe triumph of the suffrage movement is widely considered proof that our founding ideals can slowly work their way into public consciousness and extend the promise of life, liberty, and the pursuit of happiness to all. But that’s not how Yenor sees it.\n\nHe recently called this noble effort “a feat of social engineering,” and said in a 2024 debate that “what we’ve really learned in both the last 60 years, and maybe even in the last 220 years,” is that there’s nothing automatic about “the engines that seem to drive men and women toward marriage.” Those engines are “part of a large social project” that needs legal support, and the legal changes wrought since first-wave feminism appear to Yenor to have weakened “the scaffolding of that project.”\n\nIn an interview last month, I asked Yenor what he considered the relationship between first-wave feminism and marriage to be. He replied that it raises the question of whether you can “maintain a marital community while recognizing as a state each of the individuals separate from that community.”\n\nYenor is convinced that, in practice, the answer is no. “The principles in law and the goals of independent recognition from the state over generations have a wearing-down effect on the traditional family,” he told me. “I don’t know of any place that has maintained a healthy marriage culture after three generations of even first-wave feminism.”\n\nSo Heritage now faces an uncomfortable question: Does it agree with its new director of American studies?\n\nWhat makes the question particularly pressing is Heritage’s “one voice” policy. “While other organizations may have experts advocating contradictory points of view,” the institution explains, “Heritage employees are always rowing in the same direction.” If this is Yenor’s view, and he’s now a Heritage director, does that make it Heritage’s official view?\n\nYenor told me that he’s heard many directors say that Heritage “does not have a one-voice policy on feminism.” But for the foundation to allow Yenor to make these arguments now that he’s on its payroll is still a choice, a declaration that it considers them to be reasonable. That’s political poison. (“Heritage does not, and does not believe employers should, discriminate on the basis of sex in matters of employment and remuneration,” Vice President of Domestic Policy Roger Severino told me.)\n\nPeter Wehner: The intellectual and moral decline of the American right\n\nHeritage doesn’t have to fire Yenor to solve its problem. He advocates for a number of conventional conservative policy goals, such as barring access to online pornography. But Heritage ought to make clear that it supports women’s legal equality and their attendant political and economic gains, establishing a one-voice policy in favor of the legal status quo. Yenor can then apply his talents to the admittedly arduous task of moving that consensus toward a more family-friendly view that elevates the social status of mothers who choose not to work full-time.\n\nYenor might balk at that. After all, he has gained his notoriety precisely from his provocative ideas. But one must often trade provocation for power in politics. Bomb throwers have their place in political discourse; they can move public opinion with their advocacy for unpopular views. But they cannot operate within a system whose premises they undermine.\n\nHeritage and Yenor face a choice. Do they stand within the conservative consensus, seeking to extend its principles into the public consciousness and enact them into law? Or do they stand outside the Trumpian coalition because that coalition’s premises are inadequate to meet our challenges?\n\nThe first path means rejecting Yenor’s provocative views in favor of a policy agenda that can support women of all professions, full-time mothers, and conservative girlbosses. The second will, regretfully for those who have long looked to Heritage for conservative leadership, be a self-inflicted wound, ultimately pushing Heritage out of the conventional discourse and into irrelevance."
    },
    "https://www.boredpanda.com/woman-called-out-christmas-preparation/": {
        "source": "Boredpanda.com",
        "topic": "feminism",
        "title": "“You Are A Mooch”: Woman’s Brutally Blunt Holiday Message Sparks A Heated Debate",
        "content": "ADVERTISEMENT\n\nMany of us are guilty of leaning on our moms for just about everything. Whether it’s calling her when we’re sick, asking her to watch the kids at the last minute, or needing advice we could probably figure out ourselves, Mom is often the first person we turn to. She’s the safety net, the problem-solver, and the one who somehow always makes things work. Over time, that reliance becomes so normal that we barely notice how much we expect from her, especially during big moments and holidays.\n\nSpeaking of that pressure, a woman called out people who rely on their mothers to single-handedly make Christmas happen every year. She pointed out how many adults show up expecting a home, a full meal, decorations, and festive magic, without contributing to the work behind it. According to her, opting out for your own peace is fine, but expecting your mom to carry the burden forever isn’t. Her message struck a nerve online. Keep reading to see what she had to say.\n\nRELATED:\n\nThe holiday season can be incredibly stressful and exhausting for many women, often adding pressure instead of joy\n\nWoman sitting thoughtfully by a decorated Christmas tree highlighting feminism and moms doing all the labor during holidays\n\nImage credits: user25451090/Freepik (not the actual photo)\n\nOne woman called out people who rely entirely on their mothers to handle everything during the holidays, from decorating the house to preparing meals\n\nADVERTISEMENT\n\nText post emphasizing that those who do not contribute to Christmas labor do not deserve it, addressing feminism and moms.\n\nText about gendered holiday labor and feminism, highlighting moms doing most of the work during Christmas season.\n\nText emphasizing moms doing all the labor during Christmas while adults claim feminism and leave the work to them.\n\nADVERTISEMENT\n\nText criticizing adults who claim feminism but leave the labor of Christmas preparations to moms, highlighting feminist expectations.\n\nADVERTISEMENT\n\nText discussing feminism and the unfair burden on moms doing all the labor during Christmas celebrations.\n\nText image with a quote about Christmas being work for adults, highlighting feminism and labor shared by moms.\n\nADVERTISEMENT\n\nHands of a woman preparing Christmas treats surrounded by festive decorations highlighting moms doing all the labor during holidays\n\nImage credits: Freepik (not the actual photo)\n\nText about feminism and adults leaving moms to do all the Christmas labor, criticizing unfair gender roles.\n\nADVERTISEMENT\n\nText excerpt discussing working mothers, feminism, and the unequal distribution of childcare and labor responsibilities.\n\nADVERTISEMENT\n\nText graphic with a message about rejecting unfair expectations placed on mothers to bear all labor indefinitely.\n\nImage credits: anonymous\n\nThe author also opened up about her own personal experiences, adding depth and honesty to her message\n\nText conversation about Christmas labor and frustration with adults claiming feminism but leaving moms to do all the work and cleanup.\n\nText conversation about holiday invitations and criticism of adults claiming feminism while leaving moms to do all the labor during Christmas.\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nComments discussing adults who claim feminism while leaving moms to do all the labor during Christmas and Thanksgiving.\n\nComment exchange about adults avoiding holiday labor while moms handle all the work, highlighting feminism and family roles.\n\nDiscussion about feminism and Christmas labor, highlighting moms doing all the work while others claim equality and entitlement.\n\nADVERTISEMENT\n\nWomen often feel intense pressure to parent a certain way, often at the cost of their own needs and well-being\n\nWhile having a baby can be an incredibly fulfilling journey for many women, it also comes with a heavy set of expectations. Almost the moment someone becomes a mom, the pressure starts piling up. There are opinions on how to give birth, how to feed the baby, how quickly to “bounce back,” and how to juggle everything with a smile. From breastfeeding debates to comments about weight, sleep, and work-life balance, new moms often feel watched and judged.\n\nADVERTISEMENT\n\nThat pressure isn’t just anecdotal, either. According to a survey commissioned by TIME, a large majority of new mothers feel boxed into a certain idea of what “good parenting” should look like. About 70% of respondents said they felt pressure to parent in a specific way. Many admitted they felt disappointment, guilt, or even shame when real life didn’t match those expectations. Instead of enjoying the messy, imperfect moments of motherhood, they felt like they were failing an invisible test. Motherhood, for many, becomes less about instinct and more about comparison.\n\nImage credits: Monika Grabkowska/Unsplash (not the actual photo)\n\nADVERTISEMENT\n\nOn top of social pressure, there’s also an emotional weight that often goes unspoken. New moms are navigating huge hormonal shifts, lack of sleep, and a complete life adjustment. For some, this can develop into postpartum depression or anxiety. Even those without a diagnosis can feel overwhelmed, lonely, or disconnected. Yet many feel they have to hide these feelings to avoid judgment. Admitting you’re struggling can feel like admitting defeat. That silence only makes things harder. Emotional support is just as important as practical help, but it’s often overlooked.\n\nThere’s also the expectation that a mother’s entire identity should suddenly revolve around her child. Society often praises moms who “do it all” and quietly criticizes those who want space for themselves. Hobbies, careers, rest, and friendships can all be pushed aside in the name of being a “good mom.” Wanting time alone can be framed as selfish. Needing help can be seen as a weakness. This all-or-nothing mindset leaves little room for balance. Mothers are expected to give endlessly, without pause. Over time, that can take a serious toll.\n\nThe mental health impact becomes even clearer when looking at broader data. The sixth Annual State of Motherhood Report revealed that working mothers report significantly higher levels of anxiety and depression compared to working fathers. About 66% of working mothers said the pandemic negatively affected their mental health. Juggling work, childcare, household responsibilities, and emotional labor pushed many to the brink. Fathers were impacted too, but the burden was far from equal. The numbers highlight how uneven expectations still are. Motherhood often comes with an invisible workload that’s hard to escape.\n\nADVERTISEMENT\n\nMothers are also frequently expected to be the family’s default caretaker, no matter the situation. When someone is sick, mom is usually the one called. During holidays, she’s expected to plan, cook, host, decorate, and clean. Even when she’s exhausted or unwell herself, the assumption is that she’ll manage. This kind of unpaid, emotional, and physical labor is rarely acknowledged. It becomes “just what moms do.” Over time, these expectations can turn into resentment and burnout. No one can pour from an empty cup forever.\n\nADVERTISEMENT\n\nIt’s essential for moms to prioritize their mental and emotional health, not just for themselves, but for their families too\n\nPutting this much pressure on mothers is unfair and unrealistic. It treats care, effort, and sacrifice as obligations instead of choices. Mothers are human beings, not endless resources. They deserve rest, appreciation, and support, not constant demands. When society normalizes mothers carrying everything, it discourages others from stepping up. Shared responsibility shouldn’t be optional. Relieving this pressure benefits not just moms, but families as a whole. A healthier environment starts with fair expectations.\n\nThe idea of a “perfect mom” is a myth that does more harm than good. No single approach works for every family, and that’s okay. What matters most is doing what works for you and your situation. Protecting mental health and personal well-being isn’t selfish; it’s necessary. One way to start is by setting realistic expectations. You don’t have to do everything, all the time. Let go of comparisons and focus on what feels sustainable. Imperfect parenting is still good parenting.\n\nADVERTISEMENT\n\nImage credits: Alexander Grey/Unsplash (not the actual photo)\n\nSelf-compassion is another key piece that’s often overlooked. Moms are usually their own harshest critics. Learning to speak to yourself with kindness can make a big difference. Prioritizing self-care doesn’t have to mean spa days or long vacations. Sometimes it’s as simple as rest, quiet time, or saying no without guilt. Small moments of care add up over time. A supported mom is a stronger mom. Taking care of yourself helps you show up better for others, too.\n\nAsking for help is also something mothers shouldn’t feel ashamed of. No one is meant to do this alone. Whether it’s leaning on a partner, family, friends, or professionals, support matters. Sharing responsibilities can ease both physical and emotional strain. It also sets a healthy example for children about teamwork and boundaries. Strength isn’t about handling everything solo. It’s about knowing when to reach out. Accepting help is a form of self-respect.\n\nADVERTISEMENT\n\nIn this particular case, the woman spoke out against people who assume it’s okay to place endless responsibility on their mothers, especially around the holidays. She called out the idea that opting out yourself while expecting mom to pick up the slack is fair. Her message sparked a conversation about entitlement and emotional labor. What are your thoughts on this? Have you ever unknowingly put all the burden on your mom? Sometimes reflecting on these habits is the first step toward change.\n\nMany readers agreed with her perspective, pointing out that men should step up and share the responsibility as well\n\nComment discussing Christmas labor and adults claiming feminism while leaving moms to do all the work and preparation.\n\nADVERTISEMENT\n\nComment on social media criticizing adults who claim feminism but leave holiday labor to moms, highlighting unfair expectations.\n\nADVERTISEMENT\n\nScreenshot of a social media comment discussing managing Christmas stress and the unfair labor on moms during holidays.\n\nComment criticizing adults claiming feminism while leaving holiday labor to moms, urging to stop Christmas madness.\n\nADVERTISEMENT\n\nComment discussing holiday meal stress, feminism, and the unfair labor burden on moms during Christmas gatherings.\n\nADVERTISEMENT\n\nScreenshot of an online comment discussing feminism and the unequal labor moms face during the holidays.\n\nScreenshot of an online comment discussing feminism and the unequal holiday labor burden on moms.\n\nScreenshot of a Reddit comment discussing guilt over choosing self-care and the burden on moms in feminism debates.\n\nADVERTISEMENT\n\nComment from a woman discussing how adults claiming feminism leave moms to do all the Christmas labor.\n\nADVERTISEMENT\n\nText post from user hadenxcharm stating men prefer no holidays over helping with holiday labor, highlighting feminism and moms' efforts.\n\nComment discussing adults who claim feminism but leave moms with all the holiday labor, highlighting unequal effort.\n\nComment highlighting unfair labor during Christmas, calling out adults claiming feminism while leaving moms to do all work.\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nScreenshot of a social media comment discussing spending Christmas dog sitting while others avoid family responsibilities.\n\nText post about hiring help for Christmas decorations, highlighting adults avoiding labor while moms do all the work.\n\nComment discussing Christmas and family labor, highlighting feminist critique of moms doing most holiday work.\n\nADVERTISEMENT\n\nOthers felt it ultimately comes down to personal choice, arguing that no one should be criticized for doing something they genuinely enjoy\n\nWoman criticizes adults claiming feminism while leaving moms to do all Christmas labor in a family Christmas discussion.\n\nADVERTISEMENT\n\nComment discussing feminism and Christmas labor, highlighting moms doing most of the work and gifted holiday efforts.\n\nScreenshot of a comment discussing adults claiming feminism but leaving moms to do all Christmas labor.\n\nADVERTISEMENT\n\nScreenshot of a Reddit comment where a 39-year-old man shares his efforts to ease his mom's Christmas labor and hosting duties.\n\nScreenshot of a social media comment discussing feminism and the unfair labor burden on moms during Christmas traditions.\n\nADVERTISEMENT\n\nCommenter explains choosing not to do emotional or physical labor for Christmas despite loving their mom, addressing feminism and holiday labor.\n\nADVERTISEMENT\n\nWoman discusses feminism and holiday labor imbalance, criticizing adults who leave moms to do all the Christmas work.\n\nText post discussing feminism and adults leaving moms to do all the labor during Christmas while critiquing gendered roles.\n\nComment highlighting stressed moms left to do all Christmas labor while adults claim feminism without helping.\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nCommenter discussing feminism and holiday labor, emphasizing moms setting boundaries and sharing family responsibilities.\n\nReddit comment criticizing adults claiming feminism while leaving moms to handle all labor and childcare responsibilities.\n\nComment text on a white background about parents not accepting help, discussing feminism and labor during Christmas.\n\nComment discussing feminism and unpaid labor, criticizing adults who leave moms to do all the work during Christmas.\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nScreenshot of a social media comment criticizing adults who claim feminism but leave moms to do all the labor.\n\nScreenshot of a Reddit comment discussing dysfunctional family dynamics and the unfair labor moms face during Christmas.\n\nScreenshot of a Reddit comment discussing feminism and the unfair labor moms do during Christmas celebrations.\n\nADVERTISEMENT\n\nScreenshot of an online comment where a woman says hosting is not an option, highlighting moms doing all the labor in feminism debates.\n\nADVERTISEMENT"
    }
}
